{
    "abstract": "Recent years have illustrated the significantly pervasive interest in transparent antennas. The number and the popularity of transparent antenna applications have escalated dramatically. Although antenna applications are diverse and available across multiple platforms, some of these antennas are unsuitable for practical usage, particularly in cases associated with renewable energy. As such, this s...",
    "articleNumber": "9292914",
    "articleTitle": "Transparent Antenna for Green Communication Feature: A Systematic Review on Taxonomy Analysis, Open Challenges, Motivations, Future Directions and Recommendations",
    "authors": [
        {
            "preferredName": "Omar Raed Alobaidi",
            "normalizedName": "O. R. Alobaidi",
            "firstName": "Omar Raed",
            "lastName": "Alobaidi",
            "searchablePreferredName": "Omar Raed Alobaidi",
            "id": 37087140120
        },
        {
            "preferredName": "Puvaneswaran Chelvanathan",
            "normalizedName": "P. Chelvanathan",
            "firstName": "Puvaneswaran",
            "lastName": "Chelvanathan",
            "searchablePreferredName": "Puvaneswaran Chelvanathan",
            "id": 37847114100
        },
        {
            "preferredName": "Sieh Kiong Tiong",
            "normalizedName": "S. K. Tiong",
            "firstName": "Sieh Kiong",
            "lastName": "Tiong",
            "searchablePreferredName": "Sieh Kiong Tiong",
            "id": 37543107100
        },
        {
            "preferredName": "Badariah Bais",
            "normalizedName": "B. Bais",
            "firstName": "Badariah",
            "lastName": "Bais",
            "searchablePreferredName": "Badariah Bais",
            "id": 37542964800
        },
        {
            "preferredName": "Md. Akhtar Uzzaman",
            "normalizedName": "M. A. Uzzaman",
            "firstName": "Md. Akhtar",
            "lastName": "Uzzaman",
            "searchablePreferredName": "Md. Akhtar Uzzaman",
            "id": 37088542866
        },
        {
            "preferredName": "Nowshad Amin",
            "normalizedName": "N. Amin",
            "firstName": "Nowshad",
            "lastName": "Amin",
            "searchablePreferredName": "Nowshad Amin",
            "id": 37409406500
        }
    ],
    "doi": "10.1109/ACCESS.2020.3044435",
    "publicationTitle": "IEEE Access",
    "publicationYear": "2022",
    "publicationVolume": null,
    "publicationIssue": null,
    "volume": "10",
    "issue": null,
    "documentLink": "/document/9292914/",
    "xml": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<response><accessType>CCBY - IEEE is not the copyright holder of this material. Please follow the instructions via https://creativecommons.org/licenses/by/4.0/ to obtain full-text articles and stipulations in the API documentation.</accessType><div id=\"BodyWrapper\" class=\"ArticlePage\" xmlns:ieee=\"http://www.ieeexplore.ieee.org\"><div id=\"article\">\n<div class=\"section\" id=\"sec1\"><div class=\"header article-hdr\"><div class=\"kicker\">\n                                SECTION I.</div><h2>Introduction</h2></div><p>Over the past 30 years <a ref-type=\"bibr\" anchor=\"ref1\" id=\"context_ref_1_1\" data-range=\"ref1\">[1]</a>, optically transparent conductors have revolutionized electronics in many televisions <a ref-type=\"bibr\" anchor=\"ref2\" id=\"context_ref_2_1\" data-range=\"ref2\">[2]</a>, laptops <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_1\" data-range=\"ref3\">[3]</a>, smartphones <a ref-type=\"bibr\" anchor=\"ref4\" id=\"context_ref_4_1\" data-range=\"ref4\">[4]</a>, smartwatches <a ref-type=\"bibr\" anchor=\"ref5\" id=\"context_ref_5_1\" data-range=\"ref5\">[5]</a>, and solar panels <a ref-type=\"bibr\" anchor=\"ref6\" id=\"context_ref_6_1\" data-range=\"ref6\">[6]</a>. Such conductors are materials that allow light to be transmitted and at the same time and provide electrical conductivity. Transparent films (TCFs), the most widely used optically transparent conductors, are used in handheld touch screens and flat-panel TVs, among other uses <a ref-type=\"bibr\" anchor=\"ref7\" id=\"context_ref_7_1\" data-range=\"ref7\">[7]</a>. Since these deposited thin films in the visible spectrum are usually transparent, they can be deposited (mounted) on aircraft windows to provide aircraft electronics with electromagnetic interference (EMI) shielding. These materials are typically used mostly in applications where optical clarity is desired since the material (visible speed clarity) is required to be seen readily by a person and the conductivity needs are limited, since most applications are low frequency <a ref-type=\"bibr\" anchor=\"ref8\" id=\"context_ref_8_1\" data-range=\"ref8\">[8]</a>. However, Development of multimodal data mergers <a ref-type=\"bibr\" anchor=\"ref9\" id=\"context_ref_9_1\" data-range=\"ref9\">[9]</a>, <a ref-type=\"bibr\" anchor=\"ref10\" id=\"context_ref_10_1\" data-range=\"ref10\">[10]</a>, The growth in CubeSats <a ref-type=\"bibr\" anchor=\"ref11\" id=\"context_ref_11_1\" data-range=\"ref11 ref12 ref13\">[11]</a>–​<a ref-type=\"bibr\" anchor=\"ref13\" id=\"context_ref_13_1\" data-range=\"ref11 ref12 ref13\">[13]</a>, and The beginning of a drone <a ref-type=\"bibr\" anchor=\"ref14\" id=\"context_ref_14_1\" data-range=\"ref14\">[14]</a>, <a ref-type=\"bibr\" anchor=\"ref15\" id=\"context_ref_15_1\" data-range=\"ref15\">[15]</a> have, Pressure on sensor developers, among other improvements, to improve payload efficiency while reducing scale, weight, and power (SWaP). High efficiency optically translucent drivers known as antennas can be used for single-aperture lidar-radar fusion for autonomous vehicle navigation. as antenna communication and sensing on missions CubeSat, as well as on camera-lens integrated antennas for visible and thermal imaging. Optically translucent conductors’ inventions and history have paved the way for products such as antennas, connectors and filters that are transparent microwaves and millimeter-wave (mm-wave) devices. Micro-and mm-wave frequency conductors that are optically transparent allow for modern fusion methods and electromagnetic systems that have not been feasible before. This article includes a description of the fundamentals of optically transparent conductors and an efficiency comparative literature survey linked to a single merit figure indicating trade-offs between optical transmittance and radio frequency (RF) resistance. This paper provides an in-depth analysis of the optically transparent antennas introduced in recent years, along with the inspiring applications in which these antennas have an innovative potential. The main purpose of this article is to look at the different forms of transparent antennas. Discussions that revolve around optical and electrical properties are common in light of conducting thin films and transparent dielectrics. This article compiles information about transparent conductive and non-conductive antenna types. By concentrating on their design issues and compromises, the conduct of thin films and meshed conductor-made transparent antennas are addressed. They explored both optical and antenna efficiency. The main goal is to perform research that is understandable for antenna and microwave engineers. This review paper focuses on the transparent antenna (Optically transparent antenna (OTA), Transparent conductive oxide (TCO), Mesh conductive metal (MCM)). Overall, this paper will explain the subject through different aspects and stages. Firstly, discussion over literature was grouped as (Challenges, Motivations, Limitations, Recommendations, and Significant Study), each group will have different categories. Secondly, Principles of Design and Development will bring the transparent antenna from the first step of the design to the technique used to get an efficient antenna. Thirdly, critical analysis on this stage, we will give a brief on the fabrication process for each type of conductive material used for the transparent antenna. Then, we will discuss prototype validation and how researchers validated their prototype upon three-stages which comprise of steps including testing the antenna in a microwave lab, comparing with different designs with the same dimension, or comparing with published paper on the transparent antenna. finally, we talk about antenna integrated with solar cell. <a ref-type=\"fig\" anchor=\"fig1\" class=\"fulltext-link\">Figure 1</a> illustrates the main highlights of this review paper.\n<div class=\"figure figure-full\" id=\"fig1\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin1-3044435-large.gif\" data-fig-id=\"fig1\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin1-3044435-small.gif\" alt=\"FIGURE 1. - Main highlights of this review.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 1. </b><fig><p>Main highlights of this review.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p></div>\n<div class=\"section\" id=\"sec2\"><div class=\"header article-hdr\"><div class=\"kicker\">\n                                SECTION II.</div><h2>Systematic Review Protocol</h2></div><p>This study adopted the systematic literature review approach. It is an organized way to determine the literature of a definitive topic. Such systematic review applies a scientific and systematic process to determine, select, and critically assess the related research samples to collect shreds of knowledge from past research work. It offers different merits over conventional approaches as it incorporates the literature in a more transparent, precise, and reproducible manner. This systematic review approach is well-known for its compelling importance and its capability to integrate different types of research methods, not only for researchers across scientific disciplines, but also for students in postgraduate levels pursuing an integral objective in their research endeavor. The process of a systematic review consists of several stages, including identification of a research area, search procedure, criteria for research selection, data extraction process, and data synthesis. In its core, a systematic literature review aims at summarizing the topic at hand and identifying the gaps in the literature to position new research activities. In the systematic review, the studies mentioned are referred as primary studies. The systematic review is also known as secondary study.</p><div class=\"section_2\" id=\"sec2a\"><h3>A. Information Source</h3><p>In search for targeted articles, four digital databases were selected: (1) Scopus database that covers the largest abstracts and literature reviewed by peers (Scientific Magazines), (2) Science Direct database that provides access to scientific, technical, and journalistic articles, (3) IEEE Xplore Library of Technical Literature in Engineering and Technology, and (4) Web of Science (WOS) that indexes research work across disciplines in both science and social science domains. The selected databases are rich in numerous high-impact scientific journals, which demonstrate their academic resilience and scientific integrity, thus considered adequate for this review.</p></div><div class=\"section_2\" id=\"sec2b\"><h3>B. Search Strategy</h3><p>The search was initiated in July 2019 by using the advanced search boxes found in the four selected scientific databases (Science Direct, Scopus, IEEE Xplore, and WOS). Boolean operator (i.e., AND, OR) and two groups of key words (i.e., queries) were used in the article search process (see <a ref-type=\"fig\" anchor=\"fig2\" class=\"fulltext-link\">Figure 2</a>). During the processes of searching and filtering, the content of the articles was selected based on research and review articles. This option appeared suitable to capture the latest and the most related contents to the designated topic of this review.\n<div class=\"figure figure-full\" id=\"fig2\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin2-3044435-large.gif\" data-fig-id=\"fig2\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin2-3044435-small.gif\" alt=\"FIGURE 2. - Flowchart of Search Query and Inclusion Criteria for Systematic Review Protocol.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 2. </b><fig><p>Flowchart of Search Query and Inclusion Criteria for Systematic Review Protocol.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec2c\"><h3>C. Study Selection</h3><p>The research method began with a basic search that involved 829 articles. These articles underwent the following processes: (1) Duplication screening of articles, (2) Scanning of titles and abstracts to discover initial importance of articles, and (3) Full text reading and data extraction of each article to match the inclusion criteria of the protocol. Some notes and comments were taken during the process, which later turned into good insights that helped to shape the final form of this review. During the data extraction process, a range of elements were selected and keyed into the Microsoft Excel sheet.</p></div><div class=\"section_2\" id=\"sec2d\"><h3>D. Inclusion and Exclusion Criteria</h3><p><a ref-type=\"fig\" anchor=\"fig2\" class=\"fulltext-link\">Figure 2</a> illustrates the inclusion and exclusion criteria in selecting the articles. The initial target was to classify studies pertaining to transparent antenna and solar cell into four general taxonomies. With categories deriving from literature pre-survey without restriction, Google Scholar was applied first to understand the directions and the landscape within the literature. Following the initial removal of duplicates, the articles were removed in the iteration of filtering and screening upon failing to satisfy the eligibility criteria. Some of the exclusion criteria are: (1) non-English articles, and (2) articles that did not specify on antenna techniques but merely on general transparent antenna technology. In order to simplify the steps ahead, data collection was initiated. The identified articles were grouped into some initial categories from various sources. Four authors executed some full-text readings. This resulted in a large compilation of comments and highlights on the surveyed articles. A much-refined taxonomy was generated by classifying the articles. The comments were then saved on the body of the texts (relying on each author’s chosen style - softcopy or hardcopy). Next, the main findings were summarized, tabulated, and described. A collection of important and related information was saved in WORD and EXCEL files inclusive of the full list of articles, their source of database, summary and description tables, grouping tables based on transparent antenna, review sources, objectives, target audiences and platform, as well as other related aspects. The datasets were then presented in supplemental materials as the complete reference in projecting the following results.</p></div><div class=\"section_2\" id=\"sec2e\"><h3>E. Results and Statistical Information of Articles</h3><p>Initially, 829 papers were gathered; 261 papers from Scopus, 150 papers from WOS, 38 papers from ScienceDirect, and 380 papers from IEEE Explore. The articles were then filtered by publication date; between 2015 and September 2020. Upon selection, they were classified into three groups. After filtering, 330 out of the total 829 articles were duplicates. Upon checking titles and abstracts, 294 papers were further excluded, thus leaving only 205 papers. Next, another 133 papers were discarded in the final full-text review, additional 9 articles where published when we are doing the review added to the total number of articles. In total, 81 papers were selected for this review in light of transparent antenna and solar cell integration as wireless communication techniques through various topics and approaches. Based on the taxonomy portrayed in <a ref-type=\"fig\" anchor=\"fig3\" class=\"fulltext-link\">Figure 3</a>, this study had reviewed the main streams of research prioritizing on transparent antenna techniques applied in wireless communication.\n<div class=\"figure figure-full\" id=\"fig3\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin3-3044435-large.gif\" data-fig-id=\"fig3\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin3-3044435-small.gif\" alt=\"FIGURE 3. - Taxonomy of literature on transparent antennas.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 3. </b><fig><p>Taxonomy of literature on transparent antennas.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p></div></div>\n<div class=\"section\" id=\"sec3\"><div class=\"header article-hdr\"><div class=\"kicker\">\n                                SECTION III.</div><h2>Taxonomy</h2></div><p>This section presents the taxonomy applied in this study to cover all the development aspects of the transparent antenna. In doing so, the taxonomy was generated to identify the processes involved in developing a transparent antenna. <a ref-type=\"fig\" anchor=\"fig3\" class=\"fulltext-link\">Figure 3</a> illustrate the taxonomies of the transparent antenna systems that portrayed the growth of studies and the applications used. Analysis was performed for each class and subclass. The first level of the taxonomy denotes conductive type of antenna that included articles that investigated the types of conductive used with various substrates for the transparent antenna system. The second level of the taxonomy presents the transparent antenna type, which included articles that described each antenna type of study. The third level of the taxonomy describes transparent antenna or antenna used for many applications which embedded articles that looked into the applications in developing transparent antenna. <a ref-type=\"fig\" anchor=\"fig3\" class=\"fulltext-link\">Figure 3</a>. Taxonomy of literature on the transparent antennas.</p><div class=\"section_2\" id=\"sec3a\"><h3>A. Conductive Film</h3><p>Transparent conductive thin films are among the most common transparent conductors <a ref-type=\"bibr\" anchor=\"ref16\" id=\"context_ref_16_3a\" data-range=\"ref16\">[16]</a>. conductive polymers and Conductive inks, such as silver-coated polyester (AgHT-4, AgHT-8) <a ref-type=\"bibr\" anchor=\"ref17\" id=\"context_ref_17_3a\" data-range=\"ref17 ref18 ref19 ref20 ref21 ref22 ref23 ref24 ref25 ref26 ref27\">[17]</a>–​<a ref-type=\"bibr\" anchor=\"ref27\" id=\"context_ref_27_3a\" data-range=\"ref17 ref18 ref19 ref20 ref21 ref22 ref23 ref24 ref25 ref26 ref27\">[27]</a>, <a ref-type=\"bibr\" anchor=\"ref86\" id=\"context_ref_86_3a\" data-range=\"ref86\">[86]</a> and transparent conductive oxides (TCOs), including indium-tin-oxide (ITO) <a ref-type=\"bibr\" anchor=\"ref28\" id=\"context_ref_28_3a\" data-range=\"ref28 ref29 ref30 ref31 ref32 ref33 ref34\">[28]</a>–​<a ref-type=\"bibr\" anchor=\"ref34\" id=\"context_ref_34_3a\" data-range=\"ref28 ref29 ref30 ref31 ref32 ref33 ref34\">[34]</a>, fluorine-doped tin oxide (FTO) <a ref-type=\"bibr\" anchor=\"ref33\" id=\"context_ref_33_3a\" data-range=\"ref33\">[33]</a>, <a ref-type=\"bibr\" anchor=\"ref35\" id=\"context_ref_35_3a\" data-range=\"ref35 ref36 ref37\">[35]</a>–​<a ref-type=\"bibr\" anchor=\"ref37\" id=\"context_ref_37_3a\" data-range=\"ref35 ref36 ref37\">[37]</a>, Known for its high optical transmission, relatively low resistivity, non-toxicity, low material cost and good stability, the Al doped ZnO (AZO) film is one of the most promising transparent and conductive oxide (TCO) thin films <a ref-type=\"bibr\" anchor=\"ref7\" id=\"context_ref_7_3a\" data-range=\"ref7\">[7]</a>, <a ref-type=\"bibr\" anchor=\"ref38\" id=\"context_ref_38_3a\" data-range=\"ref38\">[38]</a>. and Ga-doped ZnO (GZO) <a ref-type=\"bibr\" anchor=\"ref39\" id=\"context_ref_39_3a\" data-range=\"ref39\">[39]</a>, Titanium Indium Oxide (TIO) <a ref-type=\"bibr\" anchor=\"ref34\" id=\"context_ref_34_3a\" data-range=\"ref34\">[34]</a>, <a ref-type=\"bibr\" anchor=\"ref40\" id=\"context_ref_40_3a\" data-range=\"ref40\">[40]</a>, <a ref-type=\"bibr\" anchor=\"ref41\" id=\"context_ref_41_3a\" data-range=\"ref41\">[41]</a>, and aluminum doped zinc oxide (AZO)/silver nanowire (AgNWs), or silver nanowire (AgNWs) <a ref-type=\"bibr\" anchor=\"ref42\" id=\"context_ref_42_3a\" data-range=\"ref42\">[42]</a>, <a ref-type=\"bibr\" anchor=\"ref43\" id=\"context_ref_43_3a\" data-range=\"ref43\">[43]</a>, and graphene <a ref-type=\"bibr\" anchor=\"ref44\" id=\"context_ref_44_3a\" data-range=\"ref44\">[44]</a> are popular transparent conductive thin films. The thin films that can be applied in displays, LEDs, EMI-screens, and photovoltaic equipment are most popular is indium-tin-oxide (ITO). However, there have been proposals for the future of indium shortages. Furthermore, ITO is fragile and so unacceptable in portable electronics, as other TCOs. A flexible alternative, indium-zinc-tin oxide (IZTO) <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_3a\" data-range=\"ref3\">[3]</a>, <a ref-type=\"bibr\" anchor=\"ref45\" id=\"context_ref_45_3a\" data-range=\"ref45\">[45]</a>, <a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_3a\" data-range=\"ref46\">[46]</a>, has been explored as an approach to enhancing its versatility. An additional approach to improving the conductivity of the IZTO film was explored in by manufacturing a multilayer IZTO film where silver (Ag) was sandwiched between two IZTO films. The IZTO / Ag / IZTO (IAI) multilayer film is a good conductor for the manufacture of flexible transparent antennas, but its high sheet resistance (4:99 = sq) is responsible for poor antenna quality. In the case of transparent conductional films, the conflicting relation between their sheet resistance and their optical clarity is an essential weakness in antenna output. The optical clarity of the film depends on its thickness; for better optical clarity, it is important to keep the film thickness very low. However, to keep the losses small, film thickness should be greater than the skin depth. The skin depth of thin conduction films is considerably higher than typical conductors due to its lower electric conductivity and the inversive link between skin depth and electrical conductivity <a ref-type=\"bibr\" anchor=\"ref40\" id=\"context_ref_40_3a\" data-range=\"ref40\">[40]</a>. So, there is a trade-o between the resistance of the layer and the optical transparency of thin films. <b>The third level of taxonomy</b> deals with type of study and applications of the study. Many conductive film materials have been used as the conductive layer in transparent antenna with varied substrates to design and fabricate the transparent antenna prototype, such as conductive film antenna so many types of study for many applications like <b>transparent Array antenna</b> using quartz as a substrate with ITO for solar applications <a ref-type=\"bibr\" anchor=\"ref31\" id=\"context_ref_31_3a\" data-range=\"ref31\">[31]</a>. And <b>Mesh antenna</b> using a and transparent acryl substrate with multilayer film (MLF; IZTO/Ag/IZTO) for Wi-Fi application <a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_3a\" data-range=\"ref46\">[46]</a>. And as <b>Compact and Transparent Antennas</b> using a plexiglass substrate with AgHT-8 for 5G communication systems <a ref-type=\"bibr\" anchor=\"ref18\" id=\"context_ref_18_3a\" data-range=\"ref18\">[18]</a>, or soda lime glass substrate with fluorine-doped tin oxide (FTO) for wireless local area network (WLAN) <a ref-type=\"bibr\" anchor=\"ref35\" id=\"context_ref_35_3a\" data-range=\"ref35\">[35]</a>. and as <b>Optically Transparent Antennas</b> using glass as a substrate with indium tin oxide (ITO) for solar energy harvesting <a ref-type=\"bibr\" anchor=\"ref28\" id=\"context_ref_28_3a\" data-range=\"ref28\">[28]</a>, or for car network communication application <a ref-type=\"bibr\" anchor=\"ref32\" id=\"context_ref_32_3a\" data-range=\"ref32\">[32]</a>, or using glass as substrate with AZO/AgNWs for Bluetooth communication <a ref-type=\"bibr\" anchor=\"ref43\" id=\"context_ref_43_3a\" data-range=\"ref43\">[43]</a>, or using glass as substrate with AgHT-8 for WLAN <a ref-type=\"bibr\" anchor=\"ref19\" id=\"context_ref_19_3a\" data-range=\"ref19\">[19]</a> and wireless applications <a ref-type=\"bibr\" anchor=\"ref20\" id=\"context_ref_20_3a\" data-range=\"ref20\">[20]</a>, or using glass as substrate with AgHT-4 for Wi-Fi <a ref-type=\"bibr\" anchor=\"ref25\" id=\"context_ref_25_3a\" data-range=\"ref25\">[25]</a>, or using a plexiglass substrate with AgHT-8 for wireless multiple-input and multiple output (MIMO) system <a ref-type=\"bibr\" anchor=\"ref21\" id=\"context_ref_21_3a\" data-range=\"ref21\">[21]</a> and smart devices <a ref-type=\"bibr\" anchor=\"ref86\" id=\"context_ref_86_3a\" data-range=\"ref86\">[86]</a>, or using a polyimide as substrate with TIO Terahertz communication <a ref-type=\"bibr\" anchor=\"ref40\" id=\"context_ref_40_3a\" data-range=\"ref40\">[40]</a> and satellites, radar systems <a ref-type=\"bibr\" anchor=\"ref41\" id=\"context_ref_41_3a\" data-range=\"ref41\">[41]</a>, and using a MWCNT loaded ITO and TIO for Terahertz communication <a ref-type=\"bibr\" anchor=\"ref34\" id=\"context_ref_34_3a\" data-range=\"ref34\">[34]</a>, and using a borosilicate glass substrate with FTO <a ref-type=\"bibr\" anchor=\"ref36\" id=\"context_ref_36_3a\" data-range=\"ref36\">[36]</a> or Pyrex glass substrate with FTO <a ref-type=\"bibr\" anchor=\"ref37\" id=\"context_ref_37_3a\" data-range=\"ref37\">[37]</a> for outdoor applications such as transparent antenna over solar cells, and using a Polyethylene Terephthalate (PET) substrate with AgHT-8 thin film for (RFID) tags <a ref-type=\"bibr\" anchor=\"ref22\" id=\"context_ref_22_3a\" data-range=\"ref22\">[22]</a> and UWB home entertainment network <a ref-type=\"bibr\" anchor=\"ref17\" id=\"context_ref_17_3a\" data-range=\"ref17\">[17]</a>, commercial and medical applications <a ref-type=\"bibr\" anchor=\"ref39\" id=\"context_ref_39_3a\" data-range=\"ref39\">[39]</a>, and using a sapphire substrate with gallium-doped zinc oxide (GZO) thin film for smart city concept <a ref-type=\"bibr\" anchor=\"ref7\" id=\"context_ref_7_3a\" data-range=\"ref7\">[7]</a>, and using a quartz substrate with graphene layers for practical applications <a ref-type=\"bibr\" anchor=\"ref44\" id=\"context_ref_44_3a\" data-range=\"ref44\">[44]</a>, or using Perspex acrylic dielectric substrate with (AgHT-8) thin film for wireless applications <a ref-type=\"bibr\" anchor=\"ref23\" id=\"context_ref_23_3a\" data-range=\"ref23\">[23]</a>, or using a glass substrates with ITO films for millimeter wave bands <a ref-type=\"bibr\" anchor=\"ref29\" id=\"context_ref_29_3a\" data-range=\"ref29\">[29]</a>, or using a plexiglass substrate with AgHT-8 short range multiband versatile wireless applications <a ref-type=\"bibr\" anchor=\"ref27\" id=\"context_ref_27_3a\" data-range=\"ref27\">[27]</a>. And can be as <b>Transparent and Flexible Antennas</b> using glass or polymer as substrate with AZO for window-integrated wireless sensor node <a ref-type=\"bibr\" anchor=\"ref38\" id=\"context_ref_38_3a\" data-range=\"ref38\">[38]</a>, or using a polyimide as substrate with IZTO/Ag/IZTO (IAI) for wearable glasses <a ref-type=\"bibr\" anchor=\"ref45\" id=\"context_ref_45_3a\" data-range=\"ref45\">[45]</a> and using polyamide substrate for computer laptop <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_3a\" data-range=\"ref3\">[3]</a>, or using a Polyethylene Terephthalate (PET) substrate with transparent silver nanowire (AgNWs) for automobile window, liquid crystal display, organic-light-emitting-diode display <a ref-type=\"bibr\" anchor=\"ref42\" id=\"context_ref_42_3a\" data-range=\"ref42\">[42]</a> and wireless communications for wearable systems <a ref-type=\"bibr\" anchor=\"ref47\" id=\"context_ref_47_3a\" data-range=\"ref47\">[47]</a>, and using a Polyethylene Terephthalate (PET) substrate with AgHT-4 for WLAN and Worldwide Interoperability for Microwave Access (WiMAX) deployments <a ref-type=\"bibr\" anchor=\"ref24\" id=\"context_ref_24_3a\" data-range=\"ref24\">[24]</a>, and using a cellulose acetate substrate with ITO film for WLAN and Worldwide Interoperability for Microwave Access (WiMAX) deployments <a ref-type=\"bibr\" anchor=\"ref30\" id=\"context_ref_30_3a\" data-range=\"ref30\">[30]</a>,and using a Polyethylene Terephthalate (PET) substrate with AgHT-8 thin film for 5G applications <a ref-type=\"bibr\" anchor=\"ref26\" id=\"context_ref_26_3a\" data-range=\"ref26\">[26]</a>. In total, 33 articles (41.96%) had looked into conductive film materials and five type of study (transparent Array antenna, Mesh antenna, Compact and Transparent Antennas, Optically Transparent Antennas, Transparent and Flexible Antennas) to identify or to evaluate transparent antenna approaches.</p></div><div class=\"section_2\" id=\"sec3b\"><h3>B. Conductive Metal</h3><p class=\"has-inline-formula\">Many conductive metal materials have been used as conductive layer in transparent antenna with different substrates to design and fabricate the transparent antenna prototype. transparent mesh conductors <a ref-type=\"bibr\" anchor=\"ref12\" id=\"context_ref_12_3b\" data-range=\"ref12\">[12]</a>, <a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_3b\" data-range=\"ref46\">[46]</a>, <a ref-type=\"bibr\" anchor=\"ref48\" id=\"context_ref_48_3b\" data-range=\"ref48 ref49 ref50 ref51 ref52 ref53 ref54 ref55 ref56 ref57 ref58\">[48]</a>–​<a ref-type=\"bibr\" anchor=\"ref58\" id=\"context_ref_58_3b\" data-range=\"ref48 ref49 ref50 ref51 ref52 ref53 ref54 ref55 ref56 ref57 ref58\">[58]</a> are conventional metals (usually copper or silver) consisting of pores or gaps within their surface through which light may pass through them. Unlike thin film conductors, the optical clarity of the metals themselves should not be present in meshed transparent conductors. Potential candidates for transparent flexible antenna fabrication are metallic mesh materials such as tortuous copper micromesh <a ref-type=\"bibr\" anchor=\"ref59\" id=\"context_ref_59_3b\" data-range=\"ref59\">[59]</a> and silver grid layers (AgGL) <a ref-type=\"bibr\" anchor=\"ref42\" id=\"context_ref_42_3b\" data-range=\"ref42\">[42]</a>, <a ref-type=\"bibr\" anchor=\"ref60\" id=\"context_ref_60_3b\" data-range=\"ref60\">[60]</a>. However, the trade-o between the efficiency of the antenna and the mesh characteristics implemented for light transmission <a ref-type=\"bibr\" anchor=\"ref61\" id=\"context_ref_61_3b\" data-range=\"ref61\">[61]</a> imposes a restriction on the efficient production of transparent antennas. <b>The third level of taxonomy</b> deals with type of study and applications of the study. According to the literature there are many type of study using conductive metal for transparent antenna like transparent <b>array antennas</b> using polyamide as substrate with silver bus-bar and copper (Cu) for self-powered wireless systems <a ref-type=\"bibr\" anchor=\"ref62\" id=\"context_ref_62_3b\" data-range=\"ref62\">[62]</a>, or Lexan as substrate highly conductive mesh wire for communication systems <a ref-type=\"bibr\" anchor=\"ref48\" id=\"context_ref_48_3b\" data-range=\"ref48\">[48]</a>, or solar cell as substrate with Aluminum for television, cellular mobile, and Wi-Fi <a ref-type=\"bibr\" anchor=\"ref63\" id=\"context_ref_63_3b\" data-range=\"ref63\">[63]</a>, and with copper (Cu) foils for Ka-band <a ref-type=\"bibr\" anchor=\"ref64\" id=\"context_ref_64_3b\" data-range=\"ref64\">[64]</a>, or using a fused quartz substrate with silver layer for microwave application <a ref-type=\"bibr\" anchor=\"ref65\" id=\"context_ref_65_3b\" data-range=\"ref65\">[65]</a>, or fused silica substrate with gold for indoor application <a ref-type=\"bibr\" anchor=\"ref60\" id=\"context_ref_60_3b\" data-range=\"ref60\">[60]</a>, or platinum-cured thermoset silicone with metal alloy Eutectic Gallium Indium (EGaIn) for applications involving microwave to millimeter wave bands <a ref-type=\"bibr\" anchor=\"ref58\" id=\"context_ref_58_3b\" data-range=\"ref58\">[58]</a>, other than that transparent antenna can be as <b>Circuit</b> using a plexiglass substrate with silver ink for 2.45 GHz applications <a ref-type=\"bibr\" anchor=\"ref55\" id=\"context_ref_55_3b\" data-range=\"ref55\">[55]</a>. and can be as <b>Compact and Transparent Antennas</b> using a poly vinyl chloride (PVC) substrate with sensitive metallic layer material for vehicular communication spectrum <a ref-type=\"bibr\" anchor=\"ref59\" id=\"context_ref_59_3b\" data-range=\"ref59\">[59]</a>. and can be as <b>Optically Transparent Antennas</b> using a glass as substrate with mesh silver film printed for X-band applications <a ref-type=\"bibr\" anchor=\"ref50\" id=\"context_ref_50_3b\" data-range=\"ref50\">[50]</a>, or a PET substrate with copper (Cu) micro meshed for indoor applications <a ref-type=\"bibr\" anchor=\"ref49\" id=\"context_ref_49_3b\" data-range=\"ref49\">[49]</a>, or with bulk Cu for internet of things (IoT) application <a ref-type=\"bibr\" anchor=\"ref56\" id=\"context_ref_56_3b\" data-range=\"ref56\">[56]</a>, Or with MMF copper is printed on the substrate for UHD TV Applications <a ref-type=\"bibr\" anchor=\"ref2\" id=\"context_ref_2_3b\" data-range=\"ref2\">[2]</a>, or using a quartz substrate with silver epoxy for CubeSats application <a ref-type=\"bibr\" anchor=\"ref12\" id=\"context_ref_12_3b\" data-range=\"ref12\">[12]</a>. and can be a <b>Mesh Antennas</b> using rear glass substrate with metal (Cu) mesh <inline-formula class=\"inline-formula\"><tex-math notation=\"LaTeX\">$\\mu $\n</tex-math></inline-formula>-metal mesh film (MMF) for DMB service receiving application <a ref-type=\"bibr\" anchor=\"ref53\" id=\"context_ref_53_3b\" data-range=\"ref53\">[53]</a>, or quarter glasses substrate with MMF (Cu) for DMB service receiving application <a ref-type=\"bibr\" anchor=\"ref54\" id=\"context_ref_54_3b\" data-range=\"ref54\">[54]</a>, or using a Borosilicate glass with copper (Cu) for multifunctional solar antenna devices <a ref-type=\"bibr\" anchor=\"ref66\" id=\"context_ref_66_3b\" data-range=\"ref66\">[66]</a>, or using PET substrate with silver for WLAN system <a ref-type=\"bibr\" anchor=\"ref57\" id=\"context_ref_57_3b\" data-range=\"ref57\">[57]</a>, or using Lexan as substrate with (Cu) for many future wireless applications that are projected to use unlicensed spectrum <a ref-type=\"bibr\" anchor=\"ref61\" id=\"context_ref_61_3b\" data-range=\"ref61\">[61]</a>, or using a square-lattice structure with wired metal mesh (WMM) (Cu) for wireless transparent usages <a ref-type=\"bibr\" anchor=\"ref52\" id=\"context_ref_52_3b\" data-range=\"ref52\">[52]</a>, or using a Rogers 6002 substrate with wire mesh for cube satellites (CubeSats) and Other Small Satellites <a ref-type=\"bibr\" anchor=\"ref51\" id=\"context_ref_51_3b\" data-range=\"ref51\">[51]</a>,or using a transparent acryl substrate with MMF (Cu) for Wi-Fi <a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_3b\" data-range=\"ref46\">[46]</a>. Twenty-three (28.39 %) articles had looked into conductive metal materials and five type of study (transparent Array antenna, Mesh antenna, Compact and Transparent Antennas, Optically Transparent Antennas, Circuit) to identify or to evaluate transparent antenna approaches.</p></div><div class=\"section_2\" id=\"sec3c\"><h3>C. Conductive Film and Conductive Metal</h3><p>Apart from conductive film materials, metal conductive is also applied as the ground plane with different substrates to design and fabricate transparent antenna prototype. The literature depicts the use of many conductive films and conductive metal in the same unit in the prototype. Some instance includes <b>Optically Transparent Antennas</b> using Indium tin oxide (ITO) conductive film with Gold for ultra-wideband applications (UWB) <a ref-type=\"bibr\" anchor=\"ref67\" id=\"context_ref_67_3c\" data-range=\"ref67\">[67]</a>, and <b>Multilayer Film Antennas</b> using polyimide substrate with Indium Zinc Tin Oxide (IZTO/Ag/IZTO) multilayer film and a copper (Cu) layer for wireless application <a ref-type=\"bibr\" anchor=\"ref68\" id=\"context_ref_68_3c\" data-range=\"ref68\">[68]</a>, as well as Semi-Transparent Using glass as a substrate with AgHT-4 as the radiating element and Cu as the ground component for radar application <a ref-type=\"bibr\" anchor=\"ref69\" id=\"context_ref_69_3c\" data-range=\"ref69\">[69]</a>. Three articles (3.70%) had assessed conductive films and conductive metal materials in light of transparent antenna, and two type of study (Multilayer Film Antennas, Optically Transparent Antennas) to identify or to evaluate transparent antenna approaches.</p></div><div class=\"section_2\" id=\"sec3d\"><h3>D. Water</h3><p>Liquid antennas are becoming more common because of their Functionality, such as configurability, fluidity, and tuning. Since the water represents 100% optically transparent material with very low material costs, transparent antennas are designed in contrast to other clear materials, such as transparent oxide conduction or transparent film. An optically transparent water patch antenna, consisting of the patch and ground plane, was proposed as <b>Optically Transparent Antennas</b> using plexiglass substrate with distilled water, for many promising applications in future transparent electronics designs and flexible electronics <a ref-type=\"bibr\" anchor=\"ref70\" id=\"context_ref_70_3d\" data-range=\"ref70\">[70]</a>, or for many practical applications <a ref-type=\"bibr\" anchor=\"ref71\" id=\"context_ref_71_3d\" data-range=\"ref71\">[71]</a>, and proposed as <b>Compact and Transparent Antennas</b> using plexiglass substrate with distilled water for ultra-wideband (UWB) <a ref-type=\"bibr\" anchor=\"ref72\" id=\"context_ref_72_3d\" data-range=\"ref72\">[72]</a>. Three articles (3.70%) had assessed liquid antennas (water) in light of transparent antenna, and two type of study (Optically Transparent Antennas, Compact and Transparent Antennas) to identify or to evaluate transparent antenna approaches.</p></div><div class=\"section_2\" id=\"sec3e\"><h3>E. Polymer</h3><p>Another possible use of transparent antennas is wearable technology, in which wearable devices, such as the antenna. Antennas built with a range of materials have been reported to display several shortcomings in efficiency, except for antenna made from conductive polymers that exhibited a promising potential, as mentioned in the literature proposed as <b>Optically Transparent Antennas</b> using glass as substrate with polymer for x-band satellite application <a ref-type=\"bibr\" anchor=\"ref73\" id=\"context_ref_73_3e\" data-range=\"ref73\">[73]</a>, and proposed as <b>Compact and Transparent Antennas</b> using sticky tape substrate with patterned conductive polymer (PEDOT) for ultra-wideband (UWB) application <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_3e\" data-range=\"ref74\">[74]</a>, and as <b>Transparent and Flexible Antennas</b> using Veil Shield and PDMS for Industrial, Scientific and Medical (ISM) band <a ref-type=\"bibr\" anchor=\"ref75\" id=\"context_ref_75_3e\" data-range=\"ref75\">[75]</a>, or using a polydimethylsiloxane (PDMS) substrate with conductive fabric tissue for many promising applications in future transparent electronics designs and flexible electronics <a ref-type=\"bibr\" anchor=\"ref76\" id=\"context_ref_76_3e\" data-range=\"ref76\">[76]</a>. four articles (4.93 %) had assessed polymer antennas in light of transparent antenna, and three type of study (Optically Transparent Antennas, Compact and Transparent Antennas, Transparent and Flexible Antennas) to identify or to evaluate transparent antenna approaches.</p></div><div class=\"section_2\" id=\"sec3f\"><h3>F. Others</h3><p>The literature depicts the use of other materials for the development of transparent antenna. These include <b>Array Antennas</b> using a polymethylmethacrylate (PMMA) substrates with aperture-coupled microstrip patch (ACMP) antennas for Ka-band <a ref-type=\"bibr\" anchor=\"ref77\" id=\"context_ref_77_3f\" data-range=\"ref77\">[77]</a>, or using a extruded acrylic material for satellite communications <a ref-type=\"bibr\" anchor=\"ref78\" id=\"context_ref_78_3f\" data-range=\"ref78\">[78]</a>, or using a DRA transmit array for 12 GHz usages <a ref-type=\"bibr\" anchor=\"ref79\" id=\"context_ref_79_3f\" data-range=\"ref79\">[79]</a>. and transparent antenna can be a <b>Mesh antennas</b> using a Borosilicate glass with solar cell ground plane for multifunctional solar antenna devices <a ref-type=\"bibr\" anchor=\"ref66\" id=\"context_ref_66_3f\" data-range=\"ref66\">[66]</a>, or using a Fire Retardant-4 (FR4) for cube satellites (CubeSats) and Other Small Satellites application <a ref-type=\"bibr\" anchor=\"ref11\" id=\"context_ref_11_3f\" data-range=\"ref11\">[11]</a>, or using a Roger’s RO4003C laminate for antenna arrays application <a ref-type=\"bibr\" anchor=\"ref80\" id=\"context_ref_80_3f\" data-range=\"ref80\">[80]</a>. <b>Other antennas</b>, transparent antenna or antenna integrated with solar cell can be using a Rogers RT/duroid 5870 for a cubesat applications <a ref-type=\"bibr\" anchor=\"ref81\" id=\"context_ref_81_3f\" data-range=\"ref81\">[81]</a>, or using a Rogers RT/duroid 5880 for solar cell or harvesting system <a ref-type=\"bibr\" anchor=\"ref82\" id=\"context_ref_82_3f\" data-range=\"ref82\">[82]</a> and using a protective textile foam as a substrate with conductive textile materials for solar cell or harvesting system <a ref-type=\"bibr\" anchor=\"ref83\" id=\"context_ref_83_3f\" data-range=\"ref83\">[83]</a>. and glass or flexible polymer substrates <a ref-type=\"bibr\" anchor=\"ref84\" id=\"context_ref_84_3f\" data-range=\"ref84\">[84]</a>, <a ref-type=\"bibr\" anchor=\"ref85\" id=\"context_ref_85_3f\" data-range=\"ref85\">[85]</a>. In total, 11 articles (13.58%) had reported on the use of others material in light of transparent antenna, and three type of study (Transparent Array Antennas, Transparent Mesh Antennas, Other antennas) to identify or to evaluate transparent antenna approaches.</p></div></div>\n<div class=\"section\" id=\"sec4\"><div class=\"header article-hdr\"><div class=\"kicker\">\n                                SECTION IV.</div><h2>Discussion</h2></div><div class=\"section_2\" id=\"sec4a\"><h3>A. Challenges</h3><p>The challenges and issues that the researcher’s faces are some of the most common academic intellectual dilemmas. Whether these dilemmas specifically related in the researcher’s interest field or not, they require additional attempts to solve them in order to facilitate research in the specific field. Limited availability of appropriate materials One of the main challenges in the optically transparent antenna and sensor development. The traditional transparent conductor’s lack of many properties. the challenge in materials will lead to other challenges in antenna size, flexibility, performance, and antenna characteristics, other than that will lead to other challenges in applications, research, design, fabrication, and integrated with other system. Beside all the challenges mentioned before for each research theirs are many limitations, motivations and recommendations make this field very interest for the future. For the area of systematic transparent antenna within the domain of antennas, Challenges are classified into several groups and grouped according to common features. <a ref-type=\"fig\" anchor=\"fig4\" class=\"fulltext-link\">Figure 4</a>. shows an overview of the challenges reported in the literature.\n<div class=\"figure figure-full\" id=\"fig4\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin4-3044435-large.gif\" data-fig-id=\"fig4\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin4-3044435-small.gif\" alt=\"FIGURE 4. - Overview of challenges.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 4. </b><fig><p>Overview of challenges.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p><div class=\"section_2\" id=\"sec4a1\"><h4>1) Antenna Characteristics (Gain, Efficiency, and Radiation Parameters</h4><p>Some of the most intriguing issues related to transparent antenna are gain, efficiency, and radiation parameters. Not only they are linked with the properties of the antenna itself, but they are associated with antenna applications. Hence, generating an antenna with high-quality parameters is indeed a challenge. Most of the challenges in this area, which revolve around gain, efficiency, and radiation parameters of transparent antenna, are classified into three categories: materials, design, and position of the antenna. In light of materials category, the fabricated graphene antenna gain and radiation patterns have yet to be identified, while the graphene antenna is yet to be proven for its function as a half-wavelength dipole antenna <a ref-type=\"bibr\" anchor=\"ref44\" id=\"context_ref_44_4a1\" data-range=\"ref44\">[44]</a>. Transparent antenna made of AgHT-8 suffered from low gain <a ref-type=\"bibr\" anchor=\"ref86\" id=\"context_ref_86_4a1\" data-range=\"ref86\">[86]</a>. Antennas built with a range of materials displayed several shortcomings in efficiency, except for antenna made from conductive polymers that exhibited promising potential <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_4a1\" data-range=\"ref74\">[74]</a>. Lastly, the thinner the sheet of transparent conducting material (TCM), the better is the optical transmittance. Reducing the thickness of TCM led to skin-depth losses. Due to increased skin-depth losses, the overall antenna efficiency was adversely affected <a ref-type=\"bibr\" anchor=\"ref40\" id=\"context_ref_40_4a1\" data-range=\"ref40\">[40]</a>, <a ref-type=\"bibr\" anchor=\"ref29\" id=\"context_ref_29_4a1\" data-range=\"ref29\">[29]</a>. Next, under the design category, most antenna engineers tend to face problems regarding wireless communication related to the improvement of radiation efficiency <a ref-type=\"bibr\" anchor=\"ref68\" id=\"context_ref_68_4a1\" data-range=\"ref68\">[68]</a>. A single-side metal antenna, especially wire antennas, generates low efficiency due to high loss of metallic meshes despite the increment in transparency <a ref-type=\"bibr\" anchor=\"ref43\" id=\"context_ref_43_4a1\" data-range=\"ref43\">[43]</a>. Other challenges in the proposed transparent antennas are electrical performance and radiation characteristics that either matched or exceeded the performance of conventional antennas. Meshed antennas can be designed in different combinations, such as patch antenna or both patch and ground plane made of mesh conductor. Transparency is enhanced in the last case. Leakage in ground plane can cause back radiation <a ref-type=\"bibr\" anchor=\"ref35\" id=\"context_ref_35_4a1\" data-range=\"ref35\">[35]</a>. Lastly, shark-fin antennas suffer from radiation interference in limited space and low reception sensitivity <a ref-type=\"bibr\" anchor=\"ref53\" id=\"context_ref_53_4a1\" data-range=\"ref53\">[53]</a>. Under the position of the antenna category, the placing of the antenna was located on the display’s right upper side. Still, circumstances revealed that the antenna radiation gravitated in the direction towards the ground. This phenomenon is called ‘ground effect’ <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_4a1\" data-range=\"ref3\">[3]</a>.</p></div><div class=\"section_2\" id=\"sec4a2\"><h4>2) Flexibility</h4><p>Wireless communication has become a huge issue in the field of antennas, especially with its flexibility to indicate if it can contribute towards being mechanically pliable while enabling high electrical conductivity. It is one of the challenges highlighted in the literature. Transparent antennas have become a major hit in the field of antennas despite lacking in flexibility characteristics <a ref-type=\"bibr\" anchor=\"ref75\" id=\"context_ref_75_4a2\" data-range=\"ref75\">[75]</a>, <a ref-type=\"bibr\" anchor=\"ref26\" id=\"context_ref_26_4a2\" data-range=\"ref26\">[26]</a>, <a ref-type=\"bibr\" anchor=\"ref68\" id=\"context_ref_68_4a2\" data-range=\"ref68\">[68]</a>. Drawbacks of mechanical flexibility were reported in antennas, except for antennas made from conductive polymers materials that displayed promising potential <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_4a2\" data-range=\"ref74\">[74]</a>. Conventional radio frequency (RF) antennas were fabricated by patterning metals on rigid substrates that cannot easily be strained in response to mechanical deformations, such as bending, twisting, and stretching. In order to address this issue, mechanically pliable antennas with high electrical conductivity are required <a ref-type=\"bibr\" anchor=\"ref47\" id=\"context_ref_47_4a2\" data-range=\"ref47\">[47]</a>.</p></div><div class=\"section_2\" id=\"sec4a3\"><h4>3) Antenna Size</h4><p>Antenna size is a good predictor in determining the quality of antenna. Size indication was mentioned as part of the challenges in the literature. Wireless communication connected to the improvement of size reduction is an issue faced by antenna engineers <a ref-type=\"bibr\" anchor=\"ref2\" id=\"context_ref_2_4a3\" data-range=\"ref2\">[2]</a>, <a ref-type=\"bibr\" anchor=\"ref27\" id=\"context_ref_27_4a3\" data-range=\"ref27\">[27]</a>, <a ref-type=\"bibr\" anchor=\"ref68\" id=\"context_ref_68_4a3\" data-range=\"ref68\">[68]</a>, especially in some applications such as RFID <a ref-type=\"bibr\" anchor=\"ref22\" id=\"context_ref_22_4a3\" data-range=\"ref22\">[22]</a>. Reduction in antenna size leads to weak radiation efficiency <a ref-type=\"bibr\" anchor=\"ref65\" id=\"context_ref_65_4a3\" data-range=\"ref65\">[65]</a>.</p></div><div class=\"section_2\" id=\"sec4a4\"><h4>4) Materials</h4><p>Features of transparent antenna materials are an integral aspect that significantly contributes to the success and failure of evaluation, especially in terms of quality assessments of wireless communication and applications. Materials have formidable problems; they are still prone to some challenges that stand as a barrier in the face of researchers. The challenges in terms of materials are categorized into six parts: (1) Replace traditional materials with TCM or new materials for the antenna <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_4a4\" data-range=\"ref3\">[3]</a>, <a ref-type=\"bibr\" anchor=\"ref84\" id=\"context_ref_84_4a4\" data-range=\"ref84\">[84]</a>, <a ref-type=\"bibr\" anchor=\"ref85\" id=\"context_ref_85_4a4\" data-range=\"ref85\">[85]</a>, (2) Difficulty for fabrication, especially to produce thin transparent metallic film <a ref-type=\"bibr\" anchor=\"ref86\" id=\"context_ref_86_4a4\" data-range=\"ref86\">[86]</a>, (3) Material performance limitation that limits research work on transparent antenna <a ref-type=\"bibr\" anchor=\"ref1\" id=\"context_ref_1_4a4\" data-range=\"ref1\">[1]</a>, <a ref-type=\"bibr\" anchor=\"ref87\" id=\"context_ref_87_4a4\" data-range=\"ref87\">[87]</a>, <a ref-type=\"bibr\" anchor=\"ref88\" id=\"context_ref_88_4a4\" data-range=\"ref88\">[88]</a>, (4) Materials that affect antenna design <a ref-type=\"bibr\" anchor=\"ref89\" id=\"context_ref_89_4a4\" data-range=\"ref89\">[89]</a>, (5) Costly and rare materials that have not been assessed <a ref-type=\"bibr\" anchor=\"ref90\" id=\"context_ref_90_4a4\" data-range=\"ref90\">[90]</a>. For instance, although ITO is commonly used, it is costly and brittle due to its rare-earth indium component <a ref-type=\"bibr\" anchor=\"ref4\" id=\"context_ref_4_4a4\" data-range=\"ref4\">[4]</a>, and (6) Materials that have not been examined in light of design and materials loss <a ref-type=\"bibr\" anchor=\"ref2\" id=\"context_ref_2_4a4\" data-range=\"ref2\">[2]</a>. Referring to the application for microwave frequencies, the addition of dense dielectric patch antenna (DDPA) can be applied to create patch antennas made of novel materials, in order to focus on the different challenges of complex wireless communications in future <a ref-type=\"bibr\" anchor=\"ref5\" id=\"context_ref_5_4a4\" data-range=\"ref5\">[5]</a>.</p></div><div class=\"section_2\" id=\"sec4a5\"><h4>5) Cost</h4><p>In spite of the increasing interest in pursuing cost assessment of wireless communication, especially the transparent antenna system, the lack of research work in this field is disabling researchers. They see it as a challenge to solve such an interesting problem where the absence of systematic cost analysis is the biggest challenge. The challenges in cost are due to antenna design <a ref-type=\"bibr\" anchor=\"ref65\" id=\"context_ref_65_4a5\" data-range=\"ref65\">[65]</a>, <a ref-type=\"bibr\" anchor=\"ref87\" id=\"context_ref_87_4a5\" data-range=\"ref87\">[87]</a>. This cost-related challenge <a ref-type=\"bibr\" anchor=\"ref39\" id=\"context_ref_39_4a5\" data-range=\"ref39\">[39]</a>, <a ref-type=\"bibr\" anchor=\"ref52\" id=\"context_ref_52_4a5\" data-range=\"ref52\">[52]</a> must be addressed to enable green energy techniques as alternatives. This is because; most integrated wireless systems rely on batteries that suffer from various disadvantages, such as substantial maintenance costs <a ref-type=\"bibr\" anchor=\"ref62\" id=\"context_ref_62_4a5\" data-range=\"ref62\">[62]</a>. In order to limit beam steering speed in mechanical motor platform, transparent TA(TTA) can switch the beam in H-plane at Ka-band <a ref-type=\"bibr\" anchor=\"ref77\" id=\"context_ref_77_4a5\" data-range=\"ref77\">[77]</a>, while concurrently increasing the cost of RFID <a ref-type=\"bibr\" anchor=\"ref83\" id=\"context_ref_83_4a5\" data-range=\"ref83\">[83]</a>.</p></div><div class=\"section_2\" id=\"sec4a6\"><h4>6) Fabrication</h4><p>Fabrication of transparent antenna design ascertains sufficient content quality and conformity with the current guidelines of the antenna. Fabrication of antenna is a mechanism that ensures satisfactory antenna quality and effective prototype. Transparent antenna fabrication has many methods, and each mechanism has advantages and disadvantages based on varied inputs, such as materials, size, and shape. Referring to the latter definition, it is clear how such a topic is vital to the quality of transparent antenna and wireless communication system. Fabrication poses a huge challenge. Conventional antennas are commonly fabricated using subtractive techniques that demand wet etching or lithography for structuring, as well as vacuum systems for metallization via sputtering or evaporation. These fabrication methods bear some severe disadvantages <a ref-type=\"bibr\" anchor=\"ref42\" id=\"context_ref_42_4a6\" data-range=\"ref42\">[42]</a> that limit the amount of research work, such as the intricacy of fabrication <a ref-type=\"bibr\" anchor=\"ref76\" id=\"context_ref_76_4a6\" data-range=\"ref76\">[76]</a>, smaller mesh features that lead to more challenges in fabrication <a ref-type=\"bibr\" anchor=\"ref31\" id=\"context_ref_31_4a6\" data-range=\"ref31\">[31]</a>, <a ref-type=\"bibr\" anchor=\"ref85\" id=\"context_ref_85_4a6\" data-range=\"ref85\">[85]</a>, a slight decrease in performance when compared to the simulation results in the dual-band design due to fabrication challenges <a ref-type=\"bibr\" anchor=\"ref51\" id=\"context_ref_51_4a6\" data-range=\"ref51\">[51]</a>, fabrication error that leads to outcome variance <a ref-type=\"bibr\" anchor=\"ref32\" id=\"context_ref_32_4a6\" data-range=\"ref32\">[32]</a>, disagreement between simulated and measured results due to manufacturing procedure; transparent sheet is patterned using laser cutter that generates heat, thus causing the sheet to lose its conductivity, while copper sheet is patterned using hand, thus lacking precision <a ref-type=\"bibr\" anchor=\"ref20\" id=\"context_ref_20_4a6\" data-range=\"ref20\">[20]</a>.</p></div><div class=\"section_2\" id=\"sec4a7\"><h4>7) Research Work</h4><p>Despite the increasing interest in transparent antenna and transparent wireless system, source of literature is in scarcity <a ref-type=\"bibr\" anchor=\"ref7\" id=\"context_ref_7_4a7\" data-range=\"ref7\">[7]</a>, particularly the dual-band transparent antennas that are sparse in the literature <a ref-type=\"bibr\" anchor=\"ref22\" id=\"context_ref_22_4a7\" data-range=\"ref22\">[22]</a>, <a ref-type=\"bibr\" anchor=\"ref88\" id=\"context_ref_88_4a7\" data-range=\"ref88\">[88]</a>. For example, transparent antennas based on stack film materials have received little attention <a ref-type=\"bibr\" anchor=\"ref43\" id=\"context_ref_43_4a7\" data-range=\"ref43\">[43]</a>. Meanwhile, in microstrip structures, the electromagnetic fields reproduced tend to differ, whereas no study has assessed the impact of two meshed layers on obtaining optically transparent microstrip (OTM) antennas in light of optical and electromagnetic performances <a ref-type=\"bibr\" anchor=\"ref60\" id=\"context_ref_60_4a7\" data-range=\"ref60\">[60]</a>.</p></div><div class=\"section_2\" id=\"sec4a8\"><h4>8) Design</h4><p>Transparent antenna design has witnessed improvement in terms of making the communication wireless, reliable, efficient, hassle-free, economical, and environment friendly. However, challenges are bound to surface due to design and materials. Prior studies have pointed out the design itself, materials, performance, and size as some challenges faced in building a transparent antenna. These challenges turned the design, at some point, anemic. Researchers need to address the challenges in devising new devices or services that can empower those who may need them the most. The literature depicts that the challenge related to design is mostly found in (1) materials, especially when substituting conventional non-transparent material with TCM <a ref-type=\"bibr\" anchor=\"ref40\" id=\"context_ref_40_4a8\" data-range=\"ref40\">[40]</a>. Besides, transparent antenna that employed fabric tissue on a PDMS substrate attained 70%–90% transparency. This result, however, lacked ground plane evaluation. Moreover, the enclosing environment can easily affect such antenna upon deployment <a ref-type=\"bibr\" anchor=\"ref43\" id=\"context_ref_43_4a8\" data-range=\"ref43\">[43]</a>. Additionally, slot placement on these locations can adversely affect yield due to the partial removal of the radiating element. Most of these topologies were implemented on non-transparent substrates, such as Rogers, Taconic, and FR4, along with a simple rectangular radiating element and vertical slots for band notching. Nonetheless, the resulting resonant frequency depends on the length of the vertical slots. This complicates its implementation at lower frequency, as long slots are needed, thus requiring a larger radiator footprint. High material losses can lead to feeding line losses, thus limiting the usage of such materials <a ref-type=\"bibr\" anchor=\"ref17\" id=\"context_ref_17_4a8\" data-range=\"ref17\">[17]</a>. Water has been suggested with improved performance to use as patch antennas. Yet, optic transparent is incomplete as it demands a large underground metal ground surface. Another good filter for transparent design is the usage of glass. However, the ground that supports glass is still a mineral that can affect true visual transparency to the entire antenna structure. This limits its practical application as glass is not flexible <a ref-type=\"bibr\" anchor=\"ref70\" id=\"context_ref_70_4a8\" data-range=\"ref70\">[70]</a>.</p><p>The next challenge related to design refers to (2) achieving high-speed network requirements for the antenna design <a ref-type=\"bibr\" anchor=\"ref18\" id=\"context_ref_18_4a8\" data-range=\"ref18\">[18]</a>. Placing the antenna below solar panels on the main faces can hinder issues of light-blocking. This is to ensure that the solar panel above the microstrip antenna does not strongly affect its radiation performance into a challenge <a ref-type=\"bibr\" anchor=\"ref12\" id=\"context_ref_12_4a8\" data-range=\"ref12\">[12]</a>. The efficiency of transparent microstrip patch antennas is measured at a few GHz frequencies <a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_4a8\" data-range=\"ref46\">[46]</a>. Lastly, the design of an acceptable antenna with well-maintained performing characteristics has inspired researchers worldwide to work on the deployment of sophisticated modules. It is challenging to design modern antennas that meet vehicular application demands, such as impedance bandwidth, gain, and radiation performance <a ref-type=\"bibr\" anchor=\"ref59\" id=\"context_ref_59_4a8\" data-range=\"ref59\">[59]</a>, <a ref-type=\"bibr\" anchor=\"ref89\" id=\"context_ref_89_4a8\" data-range=\"ref89\">[89]</a>.</p><p>Next, the challenge related to design lies in designing (3) an optically transparent reflect array that must not substantially weaken optical illumination <a ref-type=\"bibr\" anchor=\"ref31\" id=\"context_ref_31_4a8\" data-range=\"ref31\">[31]</a>. Impedance-matched feeding network for mesh antenna design and the finite number of mesh wires for a given area have been identified as challenges related to design. Microstrip patch antennas typically have high input impedance; while feeding the antenna with a transmission line that has characteristic impedance is equal to the input impedance of the antenna may not be functional due to the finite number of mesh wires. The sensitivity of the feed line’s impedance increases as the number of mesh lines decreases <a ref-type=\"bibr\" anchor=\"ref61\" id=\"context_ref_61_4a8\" data-range=\"ref61\">[61]</a>. Finally, the optically transparent antennas is a rousing challenge that allows antenna printing on specific surfaces, such as car windows and building glass <a ref-type=\"bibr\" anchor=\"ref50\" id=\"context_ref_50_4a8\" data-range=\"ref50\">[50]</a>. For challenges related to design found in (4) size, antenna installation and presence on small satellites bring some constraints for the antenna. In fact, mounting solar cells, antennas, and other scientific instruments through making satellites smaller have evolved into a challenge. Numerous wireless devices are yet to be launched due to the physical limitations of locating antennas. Wireless communication systems employ multiple antennas to facilitate applications that require high capacity, bandwidth, and gain. Thus, bulky structures increase spatial constraints for space applications <a ref-type=\"bibr\" anchor=\"ref37\" id=\"context_ref_37_4a8\" data-range=\"ref37\">[37]</a>, <a ref-type=\"bibr\" anchor=\"ref48\" id=\"context_ref_48_4a8\" data-range=\"ref48\">[48]</a>, <a ref-type=\"bibr\" anchor=\"ref64\" id=\"context_ref_64_4a8\" data-range=\"ref64\">[64]</a>.</p></div><div class=\"section_2\" id=\"sec4a9\"><h4>9) Integration With Solar Cell</h4><p>The future of wireless communication depends on the system and its reliability to run independently. One common way is to run the system using electrical power from varied sources. However, sources may have many disadvantages, including cost, environment-unfriendly, as well as high-cost maintenance and repair. As mentioned before, reliable sources that are cost-efficient, environment-friendly, and less maintenance are highly sought. One of these sources is the solar panel, which has been used to run the wireless communication system by integrating the system with solar panel using transparent antenna system. This integration, however, has led to many problems and challenges classified into several categories. The first category is linked to (1) performance. The integration of antennas with solar cells should not affect the aspect of performance, thus posing as a primary challenge <a ref-type=\"bibr\" anchor=\"ref82\" id=\"context_ref_82_4a9\" data-range=\"ref82\">[82]</a>, <a ref-type=\"bibr\" anchor=\"ref90\" id=\"context_ref_90_4a9\" data-range=\"ref90\">[90]</a>. The second category refers to (2) materials. An opaque metallic antenna incurs shade on the photovoltaic cells that can hinder access to light by the solar cells <a ref-type=\"bibr\" anchor=\"ref66\" id=\"context_ref_66_4a9\" data-range=\"ref66\">[66]</a>. Most of the flexible antennas depicted in the literature were fabricated on non-transparent conductors, such as copper, silver, and gold, thus placing them on an electrical circuit (e.g., solar cell) could reduce the system efficiency and degrade the system functionality <a ref-type=\"bibr\" anchor=\"ref67\" id=\"context_ref_67_4a9\" data-range=\"ref67\">[67]</a>. The third category is linked to (3) design. Due to their special properties, most of the approaches are not applicable for meshed patch antennas combined with solar panels <a ref-type=\"bibr\" anchor=\"ref80\" id=\"context_ref_80_4a9\" data-range=\"ref80\">[80]</a>. The integration of antennas with silicon solar cells of amorphous (a-Si) and crystalline (c-Si) was reported although minimizing antenna footprints and solar shadowing related designs still pose as challenges <a ref-type=\"bibr\" anchor=\"ref91\" id=\"context_ref_91_4a9\" data-range=\"ref91\">[91]</a>. The fourth category is (4) size, which refers to the limited surface area on small satellites. The surface area of antennas, test instruments, and solar cells can affect the satellites due to size and weight. A major challenge in small satellite is to fully utilize its limited surface area. Transparent antennas are generally created to maximize the solar panel surface area, which is vital for efficient harvesting of solar power and the space vehicle will be able to operate for a long term <a ref-type=\"bibr\" anchor=\"ref11\" id=\"context_ref_11_4a9\" data-range=\"ref11\">[11]</a>, <a ref-type=\"bibr\" anchor=\"ref79\" id=\"context_ref_79_4a9\" data-range=\"ref79\">[79]</a>. The last challenge category is (5) integrating solar cells, antennas, and other elements deployed in limited space, such as CubeSats or even smaller satellites. Integrating optically transparent antennas with solar cells <a ref-type=\"bibr\" anchor=\"ref28\" id=\"context_ref_28_4a9\" data-range=\"ref28\">[28]</a>, <a ref-type=\"bibr\" anchor=\"ref38\" id=\"context_ref_38_4a9\" data-range=\"ref38\">[38]</a>, <a ref-type=\"bibr\" anchor=\"ref81\" id=\"context_ref_81_4a9\" data-range=\"ref81\">[81]</a> is one of the toughest challenges to install wireless sensor nodes in modern settings as most small sensor nodes are run by battery <a ref-type=\"bibr\" anchor=\"ref38\" id=\"context_ref_38_4a9\" data-range=\"ref38\">[38]</a>.</p></div><div class=\"section_2\" id=\"sec4a10\"><h4>10) Others</h4><p>The literature depicts many other challenges faced by researchers within the transparent antenna domain and some challenges cannot be contained into classification. One of the toughest challenges in embedding wireless sensor nodes into modern gadgets is still power procreation, such as achieving the galvanic approach to transparent conducting oxide (TCO). However, designs with lower frequencies (e.g., 900 MHz) are more challenging and crave special measures to gain adequate radiation efficiency, as well as to perform electrical connection to the antenna <a ref-type=\"bibr\" anchor=\"ref38\" id=\"context_ref_38_4a10\" data-range=\"ref38\">[38]</a>. Designing optically transparent antennas and filters for smart city applications is also considered a challenge, which includes infrastructure and network capacity. Shorter broadcast distances and network dead zones would appear in frequencies for the next generation of wireless network (5G). The requirement of strict network security for cyber-physical system security in this forthcoming network poses a challenge. Achieving an interconnected system among buildings, electrical grids, end-users, and transportation services is bound to alter the existing infrastructure that can potentially create communication dead zones within cities. Reflection and scattering will inevitably cause signal degradation challenges to interconnections for open-air systems, as well as transitions between outdoor and indoor communications. These create challenges for the upcoming 5G network <a ref-type=\"bibr\" anchor=\"ref7\" id=\"context_ref_7_4a10\" data-range=\"ref7\">[7]</a>. Also, there is the urgent need to incorporate green energy techniques as alternatives, mainly because most integrated wireless systems rely on batteries that suffer from various disadvantages, such as charging losses, low charge and discharge cycle life, overheat failure, substantial maintenance costs, and intelligent power management systems. Due to the huge potential of WSN or IoT devices, some being inaccessible, battery replacement is often not feasible or time consuming <a ref-type=\"bibr\" anchor=\"ref49\" id=\"context_ref_49_4a10\" data-range=\"ref49\">[49]</a>, <a ref-type=\"bibr\" anchor=\"ref62\" id=\"context_ref_62_4a10\" data-range=\"ref62\">[62]</a>. Through integrating switches or varactors, these periodic apertures are typically tuned electronically. Electronic tuning, however, suffers from some disadvantages, such as high cost and limited to military applications, particularly in large scale applications <a ref-type=\"bibr\" anchor=\"ref58\" id=\"context_ref_58_4a10\" data-range=\"ref58\">[58]</a>. Lastly, some antennas are designed for varied locations, such as an aperture in the rear end of the roof for FM radio, and roof cavity. Thus, seeking a viable antenna position while reducing its visual perception and design consideration is challenging <a ref-type=\"bibr\" anchor=\"ref54\" id=\"context_ref_54_4a10\" data-range=\"ref54\">[54]</a>.</p></div></div><div class=\"section_2\" id=\"sec4b\"><h3>B. Motivation</h3><p>For many scientific reasons, researchers are drawn to their respected fields. Various meanings and motivations reflect the concern of researchers in this area in light of systematic transparent antenna over antennas. Researchers are keen in transparent antenna and transparent wireless system due to the huge benefits offered by this field for deployment on this planet Earth and the outside space – a breakthrough in space and earth sciences <a ref-type=\"bibr\" anchor=\"ref51\" id=\"context_ref_51_4b\" data-range=\"ref51\">[51]</a>, <a ref-type=\"bibr\" anchor=\"ref29\" id=\"context_ref_29_4b\" data-range=\"ref29\">[29]</a>. In the field of transparent electronics, optically transparent antenna and transparent electrodes have garnered interest. Researchers are also interested in transparent and conductive materials <a ref-type=\"bibr\" anchor=\"ref52\" id=\"context_ref_52_4b\" data-range=\"ref52\">[52]</a>. Novel materials for antennas are an appealing topic amongst technology companies and research institutions <a ref-type=\"bibr\" anchor=\"ref72\" id=\"context_ref_72_4b\" data-range=\"ref72\">[72]</a>, <a ref-type=\"bibr\" anchor=\"ref27\" id=\"context_ref_27_4b\" data-range=\"ref27\">[27]</a>.</p><p><a ref-type=\"fig\" anchor=\"fig5\" class=\"fulltext-link\">Figure 5</a>. lists an overview of motivations for pursuing transparent antenna studies.\n<div class=\"figure figure-full\" id=\"fig5\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin5-3044435-large.gif\" data-fig-id=\"fig5\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin5-3044435-small.gif\" alt=\"FIGURE 5. - Overview of motivation.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 5. </b><fig><p>Overview of motivation.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p><div class=\"section_2\" id=\"sec4b1\"><h4>1) Antenna Characteristics (Gain, Efficiency, and Radiation Parameters</h4><p>In light of transparent antenna and wireless communication system; gain, efficiency, and radiation parameters are essential as they encourage interaction between system and users. Researchers worldwide have proposed many strategies to enhance gain, efficiency, and radiation parameters in transparent antenna. These strategies benefit the TCO in shaping multilayer electrodes, such as organic light-emitting diodes, organic solar cells, and thin-film transistors, due to its exceptional conducting efficiency <a ref-type=\"bibr\" anchor=\"ref68\" id=\"context_ref_68_4b1\" data-range=\"ref68\">[68]</a>. The dual inverted-F array increases gain, while beam switching allows the array to sweep a wider coverage angle with larger beam widths. The transmission line and the cell of a grounding strip with 6 mm width is sufficient to isolate the transmission line from cell lattice, thus displaying improvement in gain, efficiency, and bandwidth <a ref-type=\"bibr\" anchor=\"ref91\" id=\"context_ref_91_4b1\" data-range=\"ref91\">[91]</a>. Strained wavy NW networks created by the antennas display higher efficiency of radiation and smaller return loss, when compared to antennas developed by straight NW networks. The cyclic deformation tests show improvement in stability <a ref-type=\"bibr\" anchor=\"ref47\" id=\"context_ref_47_4b1\" data-range=\"ref47\">[47]</a>. An antenna performed at 2.2-25.0 GHz band resulted in efficiency above 75% during the operating band, apart from exhibiting adequate gain and good radiation pattern <a ref-type=\"bibr\" anchor=\"ref76\" id=\"context_ref_76_4b1\" data-range=\"ref76\">[76]</a>. The high demand for wireless technologies has led fabrication of antenna to confirm its performance in terms of radiation pattern and reflection coefficient <a ref-type=\"bibr\" anchor=\"ref69\" id=\"context_ref_69_4b1\" data-range=\"ref69\">[69]</a>. In order to raise the low radiation resistance of a single element antenna made of conductive oxide with low conductivity, a dual-band OTA array is introduced <a ref-type=\"bibr\" anchor=\"ref21\" id=\"context_ref_21_4b1\" data-range=\"ref21\">[21]</a>. Finally, an effective solution for a trade-off between gain and transparency, a heterogeneous structure was used on the basis of a practical approach to increasing the efficiency of a transparent UWB antenna using gold nanolayer deposition <a ref-type=\"bibr\" anchor=\"ref88\" id=\"context_ref_88_4b1\" data-range=\"ref88\">[88]</a>.</p></div><div class=\"section_2\" id=\"sec4b2\"><h4>2) Layout</h4><p>Different advantages related to the result are offered in the field of constructing transparent antennas. Better concept and efficiency effects contain these <a ref-type=\"bibr\" anchor=\"ref68\" id=\"context_ref_68_4b2\" data-range=\"ref68\">[68]</a>, Besides, researchers have great interest in antennas designed with transparent materials <a ref-type=\"bibr\" anchor=\"ref22\" id=\"context_ref_22_4b2\" data-range=\"ref22\">[22]</a>. The practical realization and empirical measurements for a single patch antenna element with higher optical transparency, as reported in <a ref-type=\"bibr\" anchor=\"ref61\" id=\"context_ref_61_4b2\" data-range=\"ref61\">[61]</a>, did not exhibit the common shortcomings noted in transparent materials for this particular method <a ref-type=\"bibr\" anchor=\"ref88\" id=\"context_ref_88_4b2\" data-range=\"ref88\">[88]</a>. This is especially relevant for printing the design using the circuit in plastic (CiP) technology for embedded electrical components <a ref-type=\"bibr\" anchor=\"ref55\" id=\"context_ref_55_4b2\" data-range=\"ref55\">[55]</a>, in which absence of visual clutter and network coverage are some advantages and pose as an efficient solution to transparent antenna as fitting of antennas is enabled <a ref-type=\"bibr\" anchor=\"ref20\" id=\"context_ref_20_4b2\" data-range=\"ref20\">[20]</a>. For communication systems to cover more diverse locations, visibly transparent antenna arrays create favorable circumstances due to their transparency and power-steering ability <a ref-type=\"bibr\" anchor=\"ref48\" id=\"context_ref_48_4b2\" data-range=\"ref48\">[48]</a>. Other benefits include a promising solution for solar panel applications <a ref-type=\"bibr\" anchor=\"ref31\" id=\"context_ref_31_4b2\" data-range=\"ref31\">[31]</a>, and the introduction of a design paradigm for body-worn applications <a ref-type=\"bibr\" anchor=\"ref83\" id=\"context_ref_83_4b2\" data-range=\"ref83\">[83]</a>. One solution is to generate electricity from temperature gradients on a window <a ref-type=\"bibr\" anchor=\"ref38\" id=\"context_ref_38_4b2\" data-range=\"ref38\">[38]</a>, In favor of making the antenna suitable, two types of antenna have been proposed in addition to preparing spatial, beam, and directional diversity to receive power <a ref-type=\"bibr\" anchor=\"ref54\" id=\"context_ref_54_4b2\" data-range=\"ref54\">[54]</a>, The optically transparent antenna enables the set up in a wider space <a ref-type=\"bibr\" anchor=\"ref53\" id=\"context_ref_53_4b2\" data-range=\"ref53\">[53]</a>. The transmitarray (TA) is optically transparent and has the potential for beam steering in H-plane, as well as robustness mechanical <a ref-type=\"bibr\" anchor=\"ref77\" id=\"context_ref_77_4b2\" data-range=\"ref77\">[77]</a>. A multi-port antenna can also increase RF power <a ref-type=\"bibr\" anchor=\"ref49\" id=\"context_ref_49_4b2\" data-range=\"ref49\">[49]</a>.</p></div><div class=\"section_2\" id=\"sec4b3\"><h4>3) Expenses</h4><p>Transparent antenna and wireless communication are imminent costs to meet users’ needs <a ref-type=\"bibr\" anchor=\"ref47\" id=\"context_ref_47_4b3\" data-range=\"ref47\">[47]</a>. The literature of transparent antenna has listed varied benefits pertaining to cost, including the step-by-step simple and low-cost alternatives <a ref-type=\"bibr\" anchor=\"ref30\" id=\"context_ref_30_4b3\" data-range=\"ref30\">[30]</a>, <a ref-type=\"bibr\" anchor=\"ref58\" id=\"context_ref_58_4b3\" data-range=\"ref58\">[58]</a>, <a ref-type=\"bibr\" anchor=\"ref71\" id=\"context_ref_71_4b3\" data-range=\"ref71\">[71]</a>, In designing low-cost transparent antennas, increment in multiband frequency helps to achieve various kinds of sensor nodes to create wireless sensor networks <a ref-type=\"bibr\" anchor=\"ref19\" id=\"context_ref_19_4b3\" data-range=\"ref19\">[19]</a> that perform different sorts of sensor nodes to pattern wireless sensor networks <a ref-type=\"bibr\" anchor=\"ref38\" id=\"context_ref_38_4b3\" data-range=\"ref38\">[38]</a>, The proposed TA is optically transparent and low in cost <a ref-type=\"bibr\" anchor=\"ref77\" id=\"context_ref_77_4b3\" data-range=\"ref77\">[77]</a>, The FTO can replace the costly ITO as it also has good conductivity and is useful in outdoor applications <a ref-type=\"bibr\" anchor=\"ref35\" id=\"context_ref_35_4b3\" data-range=\"ref35\">[35]</a>, Nanotechnology has managed to decrease the production price of transparent antennas <a ref-type=\"bibr\" anchor=\"ref92\" id=\"context_ref_92_4b3\" data-range=\"ref92\">[92]</a>, along with suitable transparency performance and inexpensive fabrication <a ref-type=\"bibr\" anchor=\"ref52\" id=\"context_ref_52_4b3\" data-range=\"ref52\">[52]</a>, Due to its low cost, compact, and robust features, any mission requirement can be easily fitted with the antenna <a ref-type=\"bibr\" anchor=\"ref72\" id=\"context_ref_72_4b3\" data-range=\"ref72\">[72]</a>.</p></div><div class=\"section_2\" id=\"sec4b4\"><h4>4) Materials</h4><p>Transparent antenna materials significantly contribute to the success and failure of evaluation, especially in terms of antenna fabrication for a wireless communication system. The materials that make up the system dictate the antenna performance <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_4b4\" data-range=\"ref3\">[3]</a>. Transparent polymer materials are a highly flexible fabric and transparent, with the potential of integration <a ref-type=\"bibr\" anchor=\"ref76\" id=\"context_ref_76_4b4\" data-range=\"ref76\">[76]</a>. As mentioned before, the possibility of optical transparent antennas made of GZO is astounding <a ref-type=\"bibr\" anchor=\"ref39\" id=\"context_ref_39_4b4\" data-range=\"ref39\">[39]</a>. In the design of an optically transparent reflectarray using TCO <a ref-type=\"bibr\" anchor=\"ref31\" id=\"context_ref_31_4b4\" data-range=\"ref31\">[31]</a>, ITO film is the most broadly used material. It is a perfect choice due to its light transmittance, conductivity, and processing technology of the four materials (ITO, AgHT, ultrathin metal film, and metal mesh antenna) <a ref-type=\"bibr\" anchor=\"ref32\" id=\"context_ref_32_4b4\" data-range=\"ref32\">[32]</a>. Antenna designs have intensively enhanced performance using emerging materials to minimize the size for compactness and for multiple wireless functionality <a ref-type=\"bibr\" anchor=\"ref69\" id=\"context_ref_69_4b4\" data-range=\"ref69\">[69]</a>. In light of a reasonable trade-off between optical transparency and conductivity <a ref-type=\"bibr\" anchor=\"ref88\" id=\"context_ref_88_4b4\" data-range=\"ref88\">[88]</a>, the frequency-agile antenna is the first optically transparent made from such material. The antenna exhibited low visual impact at the near-point viewing distance <a ref-type=\"bibr\" anchor=\"ref50\" id=\"context_ref_50_4b4\" data-range=\"ref50\">[50]</a>, low electrical resistivity, high optical transmittance, and physically stable with ITO and FTO thin films used on polyimide substrates <a ref-type=\"bibr\" anchor=\"ref33\" id=\"context_ref_33_4b4\" data-range=\"ref33\">[33]</a>. For different applications that crave transparency and conductivity, FTO film material can be used <a ref-type=\"bibr\" anchor=\"ref35\" id=\"context_ref_35_4b4\" data-range=\"ref35\">[35]</a>. Meanwhile, graphene-based optically transparent antennas can be used for practical applications <a ref-type=\"bibr\" anchor=\"ref44\" id=\"context_ref_44_4b4\" data-range=\"ref44\">[44]</a>. Silver tin oxide is preferable in transparent antennas due to its acceptable value of conductivity and optical transparency over other conventional antennas. Transparency of the antenna has a trade-off with conductivity value, where higher transparency means lower conductivity and vice versa <a ref-type=\"bibr\" anchor=\"ref20\" id=\"context_ref_20_4b4\" data-range=\"ref20\">[20]</a>. Using the magnetron sputtering, an AZO layer was deposited on spin-coated AgNWs films to enhance the electrical performance of the AZO film <a ref-type=\"bibr\" anchor=\"ref43\" id=\"context_ref_43_4b4\" data-range=\"ref43\">[43]</a>. Transparent conductive films (TCFs) are optically transparent and electrically conductive films, thus their widely usage <a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_4b4\" data-range=\"ref46\">[46]</a>.</p></div><div class=\"section_2\" id=\"sec4b5\"><h4>5) Elasticity</h4><p>Wireless communication has become one of the big fields in the world, especially the people need it for many uses and since everything now connects to the internet rase the need for more flexible system can adapt in anywhere. One of the advantages the researcher looking for in their design is flexibility can contribute towards by bring more application. while bending the transparent antenna show high mechanical flexibility without performance drop <a ref-type=\"bibr\" anchor=\"ref76\" id=\"context_ref_76_4b5\" data-range=\"ref76\">[76]</a>, <a ref-type=\"bibr\" anchor=\"ref75\" id=\"context_ref_75_4b5\" data-range=\"ref75\">[75]</a> flexible and wearable electronic systems have promising potential, especially for conductive polymers materials promising potential in the literature <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_4b5\" data-range=\"ref74\">[74]</a>, It can operate with different curvature angles at UWB frequencies <a ref-type=\"bibr\" anchor=\"ref67\" id=\"context_ref_67_4b5\" data-range=\"ref67\">[67]</a>, In accomplishing a universal communication society, wearable watches and glasses are anticipated in playing a crucial role <a ref-type=\"bibr\" anchor=\"ref45\" id=\"context_ref_45_4b5\" data-range=\"ref45\">[45]</a>, Also, allowing active RFID tag to be flexible, low-visibility, compact, modular and lightweight. The capabilities of processing, sensing and decision-making will be equipped as well <a ref-type=\"bibr\" anchor=\"ref83\" id=\"context_ref_83_4b5\" data-range=\"ref83\">[83]</a>. it potentially suitable for future flexible transparent electronics and wearable devices, by using ITO (indium tin oxide) offers enhanced film brittleness and moderate sheet resistance <a ref-type=\"bibr\" anchor=\"ref30\" id=\"context_ref_30_4b5\" data-range=\"ref30\">[30]</a>, <a ref-type=\"bibr\" anchor=\"ref56\" id=\"context_ref_56_4b5\" data-range=\"ref56\">[56]</a>. The arrival of mobile communication has made antennas ubiquitous. Traditional methods of manufacturing antennas will not be able to provide the increasing request for novel applications as it requires both flexible and transparent antennas. The flexibility addition to these mentioned antennas ensures that it can be applied on the surface, which will not have planar geometry <a ref-type=\"bibr\" anchor=\"ref42\" id=\"context_ref_42_4b5\" data-range=\"ref42\">[42]</a>.The flexibility to such antennas makes sure that it can be used on the surfaces are not having planar geometry <a ref-type=\"bibr\" anchor=\"ref24\" id=\"context_ref_24_4b5\" data-range=\"ref24\">[24]</a>.</p></div><div class=\"section_2\" id=\"sec4b6\"><h4>6) Production</h4><p>Manufacturing a transparent antenna ascertains that the quality of the antenna is in line with present antenna guidelines. Antenna manufacturing is a mechanism aimed at ensuring satisfactory antenna quality and optimal prototype operation. The proposed method, which involves precipitation of homogeneous and heterogeneous gold nanostructures via DC deposition, does not contain the common limitations of transparent materials <a ref-type=\"bibr\" anchor=\"ref88\" id=\"context_ref_88_4b6\" data-range=\"ref88\">[88]</a>. The entire structure becomes optically transparent except for the small central feeding probe. Due to water use, the proposed transparent antenna is less expensive and easier to manufacture than previously reported transparent antennas <a ref-type=\"bibr\" anchor=\"ref70\" id=\"context_ref_70_4b6\" data-range=\"ref70\">[70]</a>. The goal of the investigation is to find laser parameters that remove the Cu coating at maximum optical transparency of the ablated area, as well as to identify the relationship among laser parameters, designed antenna layout, and generated antenna geometry. At the optimized laser parameters, a linear relationship between the designed layout trace width and the generated trace width was found. The relationship enabled the production of antenna geometries with high precision that operated at the designed frequency <a ref-type=\"bibr\" anchor=\"ref93\" id=\"context_ref_93_4b6\" data-range=\"ref93\">[93]</a>. Optically transparent antennas printed on transparent substrates present an alternative route to circumvent such problems. These antennas need, nevertheless, to be fabricated from transparent and conducting layers <a ref-type=\"bibr\" anchor=\"ref65\" id=\"context_ref_65_4b6\" data-range=\"ref65\">[65]</a>. This reflects an effortless method for the fabrication of transparent antennas, instead of the costly direct copper spattering on the glass <a ref-type=\"bibr\" anchor=\"ref87\" id=\"context_ref_87_4b6\" data-range=\"ref87\">[87]</a>.</p></div><div class=\"section_2\" id=\"sec4b7\"><h4>7) Antenna Dimension</h4><p>Minimum antenna size plays a worthy sign in the applications and a good predictor of appraising the quality of the antenna. When a transparent antenna is electrically small <a ref-type=\"bibr\" anchor=\"ref87\" id=\"context_ref_87_4b7\" data-range=\"ref87\">[87]</a>, it minimizes the unit volume, enables portable deployment <a ref-type=\"bibr\" anchor=\"ref91\" id=\"context_ref_91_4b7\" data-range=\"ref91\">[91]</a>, reduces space consumption, and increases aesthetic values of the wireless system installed due to its high transparency <a ref-type=\"bibr\" anchor=\"ref17\" id=\"context_ref_17_4b7\" data-range=\"ref17\">[17]</a>. Plenty of research work had attempted to make the size of the antenna smaller while establishing high efficiency and transparency using conductive oxide materials. At the constant need to design transparent antennas in small sizes for multiband frequency application <a ref-type=\"bibr\" anchor=\"ref19\" id=\"context_ref_19_4b7\" data-range=\"ref19\">[19]</a>, IoT addresses the requirements and offers capabilities for the modern concepts of wireless sensing, such as tiny electronics components, which are implemented for different types of sensor nodes to form wireless sensor networks <a ref-type=\"bibr\" anchor=\"ref38\" id=\"context_ref_38_4b7\" data-range=\"ref38\">[38]</a>. Upon considering stringent size restrictions involved in CubeSat designs, the proposed solution provides significant overall system size reduction and design flexibility <a ref-type=\"bibr\" anchor=\"ref81\" id=\"context_ref_81_4b7\" data-range=\"ref81\">[81]</a>. The automotive industry has reported a significant growth in network protocols and miniaturized electronics in combination with vehicular communication modules. Mobile communication advanced techniques are embedded into the automotive systems to give accurate information and road-safety precautions to drivers at speedy data rates <a ref-type=\"bibr\" anchor=\"ref59\" id=\"context_ref_59_4b7\" data-range=\"ref59\">[59]</a>.</p></div><div class=\"section_2\" id=\"sec4b8\"><h4>8) Antenna Amalgamation With Solar Cell</h4><p>The future of wireless communication depends on the system and how it can reliably run independently. One of the most comment ways to run the system is by using electrical power from different sources. With the rapid development of autonomous communication systems, antennas integrated with solar cells have received much attention from researchers as such a combination may save valuable “real estate” <a ref-type=\"bibr\" anchor=\"ref82\" id=\"context_ref_82_4b8\" data-range=\"ref82\">[82]</a>, <a ref-type=\"bibr\" anchor=\"ref85\" id=\"context_ref_85_4b8\" data-range=\"ref85\">[85]</a>. With the use of highly efficient and low voltage boost converter, even in low light conditions, the cell can still power the sensor and offer battery charge. Another option of power source with solar cells and accomplished with antenna integration refers to A-Si cells, which are flexible, low in cost, and can be easily fitted by trimming it into any shape desired <a ref-type=\"bibr\" anchor=\"ref91\" id=\"context_ref_91_4b8\" data-range=\"ref91\">[91]</a>. Transparent antennas have attracted a lot of attention these days due to their potential technical applications. It can be integrated with solar cells (SOLANT) to achieve small, but higher performance satellites, also designed and integrated with solar cells <a ref-type=\"bibr\" anchor=\"ref12\" id=\"context_ref_12_4b8\" data-range=\"ref12\">[12]</a>, <a ref-type=\"bibr\" anchor=\"ref35\" id=\"context_ref_35_4b8\" data-range=\"ref35\">[35]</a>, <a ref-type=\"bibr\" anchor=\"ref36\" id=\"context_ref_36_4b8\" data-range=\"ref36\">[36]</a>. One method to solve this problem is to use an optically transparent microstrip antenna on top of the solar cells <a ref-type=\"bibr\" anchor=\"ref28\" id=\"context_ref_28_4b8\" data-range=\"ref28\">[28]</a>, <a ref-type=\"bibr\" anchor=\"ref37\" id=\"context_ref_37_4b8\" data-range=\"ref37\">[37]</a>, <a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_4b8\" data-range=\"ref46\">[46]</a>, <a ref-type=\"bibr\" anchor=\"ref80\" id=\"context_ref_80_4b8\" data-range=\"ref80\">[80]</a>, <a ref-type=\"bibr\" anchor=\"ref81\" id=\"context_ref_81_4b8\" data-range=\"ref81\">[81]</a>. Employing a meshed-shape conductor is another method for transparent antenna applications <a ref-type=\"bibr\" anchor=\"ref66\" id=\"context_ref_66_4b8\" data-range=\"ref66\">[66]</a>. The goal is to test the reliability of Wi-Fi systems with solar panels. So, the solar source can be applied to supply the transparent Wi-Fi antenna in a real environment that ultimately moves towards green energy and sustainable technology. A Wi-Fi device connects to the network via an access point. A Wi-Fi system provides wireless network communications between computers and other portable devices by placing fixed access points over a short distance through WLANs. Currently, the main source of power generation derives from fossil fuel, which is not sustainable. With the increasing price of fossil fuel, more sustainable energy can be harvested from the sun (solar energy) – signifying green energy <a ref-type=\"bibr\" anchor=\"ref25\" id=\"context_ref_25_4b8\" data-range=\"ref25\">[25]</a>, <a ref-type=\"bibr\" anchor=\"ref49\" id=\"context_ref_49_4b8\" data-range=\"ref49\">[49]</a>, <a ref-type=\"bibr\" anchor=\"ref90\" id=\"context_ref_90_4b8\" data-range=\"ref90\">[90]</a>. The balance between antenna and solar cell functions is maintained. Solar cell energy harvesting is not significantly affected by the presence of reflectarray antenna when the light source is normal to the reflectarray aperture surface <a ref-type=\"bibr\" anchor=\"ref31\" id=\"context_ref_31_4b8\" data-range=\"ref31\">[31]</a>, <a ref-type=\"bibr\" anchor=\"ref78\" id=\"context_ref_78_4b8\" data-range=\"ref78\">[78]</a>. The focus is, hence, an alternative design where the antenna is placed on top of the solar cells <a ref-type=\"bibr\" anchor=\"ref80\" id=\"context_ref_80_4b8\" data-range=\"ref80\">[80]</a>. The work continues to propel the research on reflectarray antennas integrated with solar cells. a Ka-band reflectarray integrated with solar cells is presented to achieve better antenna and optical performances <a ref-type=\"bibr\" anchor=\"ref62\" id=\"context_ref_62_4b8\" data-range=\"ref62\">[62]</a>, <a ref-type=\"bibr\" anchor=\"ref64\" id=\"context_ref_64_4b8\" data-range=\"ref64\">[64]</a> by integrating the external section of mobile devices on such components or by placing such structures below the solar-energy harvesting components. Such design enables the semi-transparent feature, which may be suitable for future solar energy harvesting feature in compact devices <a ref-type=\"bibr\" anchor=\"ref69\" id=\"context_ref_69_4b8\" data-range=\"ref69\">[69]</a>. In order to fix the captured RF energy into a useful DC power that can be utilized by combining it with the solar panel output, an RF-rectifying circuit is created <a ref-type=\"bibr\" anchor=\"ref63\" id=\"context_ref_63_4b8\" data-range=\"ref63\">[63]</a>. Transparent antenna design can be an option to achieve newly phased arrays on the solar panels and other beam steering systems. However, similar CP design has not been achieved for meshed patch antenna to be fully equipped within commercial solar panels for small satellite applications <a ref-type=\"bibr\" anchor=\"ref11\" id=\"context_ref_11_4b8\" data-range=\"ref11\">[11]</a>.</p></div><div class=\"section_2\" id=\"sec4b9\"><h4>9) Performance</h4><p>When it comes to transparent antenna and transparent wireless system, performance linked to system using the antenna is important to both user and applications. The literature depicts that antenna performance has garnered attention amongst researchers, especially if the antenna made is transparent. The resulting antennas show excellent performance under mechanical deformation due to the wavy configuration, which allows the release of stress applied to the NWs and an increase in the contact area between NWs <a ref-type=\"bibr\" anchor=\"ref47\" id=\"context_ref_47_4b9\" data-range=\"ref47\">[47]</a>. The TA unit offers 300° of phase-shift and lower insertion loss at 28.5 GHz. Both measurement and simulation results present a wide angular of beam scanning besides high gain and low sidelobe level. The TA is designed from meshed double circle rings to avoid degradation transparency while keeping the good transmission characteristics at Ka-band application <a ref-type=\"bibr\" anchor=\"ref77\" id=\"context_ref_77_4b9\" data-range=\"ref77\">[77]</a>. For small RF passive components at low-performance levels, the antenna can be used as the measurement results reported in <a ref-type=\"bibr\" anchor=\"ref52\" id=\"context_ref_52_4b9\" data-range=\"ref52\">[52]</a>.</p></div><div class=\"section_2\" id=\"sec4b10\"><h4>10) Others</h4><p>Lastly, the worldwide researchers’ motivation increased as they try to make this world a better place to live in. However, some of this motivation cannot be grouped into categories. One huge motivation refers to the main radiators made of water, which is available everywhere. One of the promising materials for the transparent antenna is water due to its merited advantages over the other transparent materials. Besides being environment-friendly and easily available, water is optically transparent <a ref-type=\"bibr\" anchor=\"ref70\" id=\"context_ref_70_4b10\" data-range=\"ref70\">[70]</a>. A transparent antenna takes advantage of spatial extensibility more so than the other antennas in terms of the wide range of usable area <a ref-type=\"bibr\" anchor=\"ref92\" id=\"context_ref_92_4b10\" data-range=\"ref92\">[92]</a>. The number of installed antennas is indeed growing. Transparent antennas give more degree of ability in the installation, as they can be located in the window, photovoltaic panels, and even with light sources <a ref-type=\"bibr\" anchor=\"ref26\" id=\"context_ref_26_4b10\" data-range=\"ref26\">[26]</a>, <a ref-type=\"bibr\" anchor=\"ref87\" id=\"context_ref_87_4b10\" data-range=\"ref87\">[87]</a>.</p></div></div><div class=\"section_2\" id=\"sec4c\"><h3>C. Limitation</h3><p>Research limitations are one of the most common academic dilemmas that a researcher can face. Whether it is directly or indirectly related to the field of research, more efforts will be needed to address it and enhance scientific knowledge in this field. In the field of systematic transparent antennas, research deficiencies are distributed through different groups and grouped according to specific general features, which makes it easier to identify from potential researchers. Some categories linked to research limitations are: (1) materials, (2) fabrication, (3) design, (4) flexibility, (5) antenna characteristics, (6) application, (7) combination with solar cell, and (8) others. <a ref-type=\"fig\" anchor=\"fig6\" class=\"fulltext-link\">Figure 6</a>. presents an overview of research limitations.\n<div class=\"figure figure-full\" id=\"fig6\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin6-3044435-large.gif\" data-fig-id=\"fig6\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin6-3044435-small.gif\" alt=\"FIGURE 6. - Limitation overview.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 6. </b><fig><p>Limitation overview.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p><div class=\"section_2\" id=\"sec4c1\"><h4>1) Materials</h4><p>The estimated average conduction efficiency of nearly 90% indicates that this type of antenna can overcome the limitations in conductivity and thickness of conductive polymers <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_4c1\" data-range=\"ref74\">[74]</a>. Integration of conformal antennas with solar cells is particularly valuable for CubeSat communication, as the antennas, when strategically integrated with solar cells, do not compete for the limited surface real estate and dismiss mechanical deployment that is limited by the progress in material engineering <a ref-type=\"bibr\" anchor=\"ref85\" id=\"context_ref_85_4c1\" data-range=\"ref85\">[85]</a>. Under similar conditions, conventional TEGs are able to back up a low part of the temperature; thus, making it close to being non-useful in applications, where efficient heat sinks cannot be used. Kapton CS colorless has limited availability, as yellow Kapton NH has been used to make the TEG prototypes. It has created certain limitations on possible antenna structures. As mentioned before, in order to reduce the conductivity limitation, the distribution of electric current should be as even as possible on the antenna, which means modest structures without meandering <a ref-type=\"bibr\" anchor=\"ref38\" id=\"context_ref_38_4c1\" data-range=\"ref38\">[38]</a>. The fundamental limitations on the conductivity of the materials may result in lower microwave performance <a ref-type=\"bibr\" anchor=\"ref73\" id=\"context_ref_73_4c1\" data-range=\"ref73\">[73]</a>. Considering how there is limited conductivity in AgNWs, it is believed that AgNW lines will result in “insertion loss” depending on the frequency of its signal <a ref-type=\"bibr\" anchor=\"ref42\" id=\"context_ref_42_4c1\" data-range=\"ref42\">[42]</a>. In metallic patch, the gain is not high due to dielectric loss in distilled water, as well as small-sized the water ground plane <a ref-type=\"bibr\" anchor=\"ref72\" id=\"context_ref_72_4c1\" data-range=\"ref72\">[72]</a>.</p></div><div class=\"section_2\" id=\"sec4c2\"><h4>2) Fabrication</h4><p>Standard PCB printing technology limitation is to lower ohmic losses <a ref-type=\"bibr\" anchor=\"ref77\" id=\"context_ref_77_4c2\" data-range=\"ref77\">[77]</a>. For all patch configurations, the phase responses can be seen to match rather good at 26 GHz. The simulated and experimental inconsistencies are mostly caused by manufacturing tolerance setup errors and prior limitations of the ITO surface impedance model <a ref-type=\"bibr\" anchor=\"ref31\" id=\"context_ref_31_4c2\" data-range=\"ref31\">[31]</a>. Due to fabrication errors and resistivity difference of the semi-transparent material, the measurements indicate slight degradation at the upper frequency <a ref-type=\"bibr\" anchor=\"ref69\" id=\"context_ref_69_4c2\" data-range=\"ref69\">[69]</a>. The reason of simulated and measured gain having a difference is because of the unavoidable measurement system and fabrication error. It tends to also cause some unpredictable deviations likely due to the existence of possible air bubbles in distilled water <a ref-type=\"bibr\" anchor=\"ref72\" id=\"context_ref_72_4c2\" data-range=\"ref72\">[72]</a>.</p></div><div class=\"section_2\" id=\"sec4c3\"><h4>3) Design</h4><p>The proposed antenna and conventional laminator antenna were compared and revealed limitations in the conventional microstrip patch antenna that had a narrow bandwidth and low gain <a ref-type=\"bibr\" anchor=\"ref41\" id=\"context_ref_41_4c3\" data-range=\"ref41\">[41]</a>. The small satellite antenna design displayed some limitations, such as limited surface area, limited antenna mounting positions, and a spreading mechanism <a ref-type=\"bibr\" anchor=\"ref79\" id=\"context_ref_79_4c3\" data-range=\"ref79\">[79]</a>. A dual-band CP antenna metamaterial based on the reported raw material was denoted as inappropriate because its second antenna for embedded materials contained within a traditional patch that occupies a large area and reduces antenna transparency <a ref-type=\"bibr\" anchor=\"ref51\" id=\"context_ref_51_4c3\" data-range=\"ref51\">[51]</a>.</p></div><div class=\"section_2\" id=\"sec4c4\"><h4>4) Flexibility</h4><p>This technology cannot be used for flexible and transparent antennas because there is no short, flexible, transparent pin and electrical conductor. However, MWCNT can overcome these limitations, thus used to design a flexible and visually transparent microstrip patch antenna <a ref-type=\"bibr\" anchor=\"ref34\" id=\"context_ref_34_4c4\" data-range=\"ref34\">[34]</a>.</p></div><div class=\"section_2\" id=\"sec4c5\"><h4>5) Antenna Characteristics</h4><p>Due to its transparent property, it can also be deployed without compromising aesthetic values or users’ noticing, especially for covert operations. Since this is a pulsed system, the lower gains in a limited higher frequency band will not severely affect its overall performance in real applications <a ref-type=\"bibr\" anchor=\"ref17\" id=\"context_ref_17_4c5\" data-range=\"ref17\">[17]</a>. The measured gain is slightly smaller than the simulation value due to some air bubbles in the water bearing the fabrication, as some electromagnetic waves can leak through the water earth to the back direction <a ref-type=\"bibr\" anchor=\"ref70\" id=\"context_ref_70_4c5\" data-range=\"ref70\">[70]</a>. Our technology also sets limits for higher operating frequencies (100 GHz and above). In this case, the degree of the network will need to be reduced at the expense of optical transparency <a ref-type=\"bibr\" anchor=\"ref65\" id=\"context_ref_65_4c5\" data-range=\"ref65\">[65]</a>. The PET insulating polymer membranes are used for this research, and the effect on the electrical properties of invisible antennas was limited to the thickness of the submillimeter film layer <a ref-type=\"bibr\" anchor=\"ref56\" id=\"context_ref_56_4c5\" data-range=\"ref56\">[56]</a>. Meanwhile, antennas made from glass, which are created to use in military, FM radios, and inside aircrafts, suffer from low gain <a ref-type=\"bibr\" anchor=\"ref87\" id=\"context_ref_87_4c5\" data-range=\"ref87\">[87]</a>.</p></div><div class=\"section_2\" id=\"sec4c6\"><h4>6) Combination With Solar Cell</h4><p>This is especially practical for end-fire antennas and may have limited applications for wide antennas. Antenna integration at the top of the solar cells provides the required coverage for many applications, but it may reduce the efficiency of the solar cells due to the effects of antenna shading <a ref-type=\"bibr\" anchor=\"ref73\" id=\"context_ref_73_4c6\" data-range=\"ref73\">[73]</a>. The blockage that the antenna brought on the solar cells, which reduced the amount of solar energy harvested into the system, was the main limitation <a ref-type=\"bibr\" anchor=\"ref78\" id=\"context_ref_78_4c6\" data-range=\"ref78\">[78]</a>.</p></div><div class=\"section_2\" id=\"sec4c7\"><h4>7) Others</h4><p>The receivers come in two basic structures: direct detection and ultra-high contrast. Direct detection feeds an incident RF signal to a carrier frequency detector, usually including a limited amplification stage <a ref-type=\"bibr\" anchor=\"ref30\" id=\"context_ref_30_4c7\" data-range=\"ref30\">[30]</a>, <a ref-type=\"bibr\" anchor=\"ref58\" id=\"context_ref_58_4c7\" data-range=\"ref58\">[58]</a>. Transparent arrays will be able to solve the demand of both improved system capacity and eradicate the location limits, where antennas can be set up and viable set ups include windows of buildings and cars <a ref-type=\"bibr\" anchor=\"ref48\" id=\"context_ref_48_4c7\" data-range=\"ref48\">[48]</a>.</p></div></div><div class=\"section_2\" id=\"sec4d\"><h3>D. Recommendation &amp; Future Work</h3><p>This Section offers suggestions for future attempts of transparent antenna. The subsection is composed of four major aspects: design and fabrication, materials, research, as well as application and solar cell. <a ref-type=\"fig\" anchor=\"fig7\" class=\"fulltext-link\">Figure 7</a>. illustrates an overview of the recommendations and future work.\n<div class=\"figure figure-full\" id=\"fig7\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin7-3044435-large.gif\" data-fig-id=\"fig7\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin7-3044435-small.gif\" alt=\"FIGURE 7. - Recommendation &amp; future work overview.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 7. </b><fig><p>Recommendation &amp; future work overview.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p><div class=\"section_2\" id=\"sec4d1\"><h4>1) Recommendation of Design and Fabrication</h4><p>Future work includes improving peak gain by analyzing different types of network structures, through which the antenna can be manufactured, as well as examining the existence of mutual coupling between the two antenna elements when adapting into an array <a ref-type=\"bibr\" anchor=\"ref61\" id=\"context_ref_61_4d1\" data-range=\"ref61\">[61]</a>. The antenna displayed overall good performance, while the bending effects were determined via measurements and simulation. The antenna elements were developed using a laser machine <a ref-type=\"bibr\" anchor=\"ref76\" id=\"context_ref_76_4d1\" data-range=\"ref76\">[76]</a>. The research revealed that the planer dipole antenna can be fabricated using GZO. Transparent antennas are more practical, but it needs to be researched intensively. This demands other deposition techniques to fabricate the employment of another transparent substrate material. The future of transparent transmitters include the potential of GZO antennas as materials <a ref-type=\"bibr\" anchor=\"ref39\" id=\"context_ref_39_4d1\" data-range=\"ref39\">[39]</a>.</p></div><div class=\"section_2\" id=\"sec4d2\"><h4>2) Recommendation for Materials</h4><p>In near future, PEDOT thin films with even thinner thickness are expected to improve efficiency, conductivity, and uniformity <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_4d2\" data-range=\"ref74\">[74]</a>. In future, copper may be replaced as a metal layer in the traditional antenna fabrication process, where AZO/AgNWs stacked films can be used and could be extensively tested in communication antenna <a ref-type=\"bibr\" anchor=\"ref43\" id=\"context_ref_43_4d2\" data-range=\"ref43\">[43]</a>. An impedance bandwidth (10dB) of 10.13% and 7.6% was yielded respectively by ITO and TIO-based transparent antennas. This broadband width (45%) allows future inter-satellite communication system designs <a ref-type=\"bibr\" anchor=\"ref34\" id=\"context_ref_34_4d2\" data-range=\"ref34\">[34]</a>. Optical and electrical applications of the transparent material may be incorporated into wearable devices in future <a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_4d2\" data-range=\"ref46\">[46]</a>.</p></div><div class=\"section_2\" id=\"sec4d3\"><h4>3) Recommendation of Application and Integration With Solar Cell</h4><p>There is an opportunity for printed multilayer antenna designs by making use of AuGL, which is transparent and conductive material to accomplish efficient microstrip systems under the band of 60 GHz for indoor applications <a ref-type=\"bibr\" anchor=\"ref60\" id=\"context_ref_60_4d3\" data-range=\"ref60\">[60]</a>. In order to rectify the wideband RF energy into DC output, the wideband rectifier can be applied. The solar panel and the rectenna systems DC output can be placed together to obtain a diverse dual-source energy-harvesting solution outcome <a ref-type=\"bibr\" anchor=\"ref63\" id=\"context_ref_63_4d3\" data-range=\"ref63\">[63]</a>. This novel transparent patch antenna has plenty of potential applications on flexible electronics and transparent electronics design in the future due to its low cost and outstanding performances in radiation <a ref-type=\"bibr\" anchor=\"ref70\" id=\"context_ref_70_4d3\" data-range=\"ref70\">[70]</a>. The TA unit is the kind of antenna that offers a visual impact that enables 5G application as a small unit and smart-street equipment. Scan loss and sidelobe level of the beams, as well as the design, are fully electronically switchable focal array that will be a hub for future work improvement <a ref-type=\"bibr\" anchor=\"ref64\" id=\"context_ref_64_4d3\" data-range=\"ref64\">[64]</a>. In future work, the microwave frequencies defined in this article aim to fabricate and examine different GZO filters that were formerly designed for military, medical, civilian applications, as well as for near-infrared and optical frequencies <a ref-type=\"bibr\" anchor=\"ref39\" id=\"context_ref_39_4d3\" data-range=\"ref39\">[39]</a>. Upon anticipating the future, TCO reflectarray will have plenty of interests and promising applications. As the technology of TCO material is constantly improved, integrating the TCO material technology into designs of high-gain planar antennas will increase attention. Transparent planar reflectarrays will become attractive options for plenty of future technology ventures as TCO reflectarray performances hold promising demonstrations, as well as the increasing attraction of this technology in satellite and aesthetic applications <a ref-type=\"bibr\" anchor=\"ref31\" id=\"context_ref_31_4d3\" data-range=\"ref31\">[31]</a>. As a result of its low thickness, lightweight structure, and high transparency characteristics, many RFID applications have been enabled, such as supply chains, warehouses, and access controls <a ref-type=\"bibr\" anchor=\"ref22\" id=\"context_ref_22_4d3\" data-range=\"ref22\">[22]</a>. The designed antenna set up for its semi-transparent feature is suitable for future solar energy harvesting feature in compact devices <a ref-type=\"bibr\" anchor=\"ref69\" id=\"context_ref_69_4d3\" data-range=\"ref69\">[69]</a>. The proposed antenna is a good option for independent communication systems. The reason is that it has potential advantages of non-shading, wide resistance, flat structure and width of CP radiation ranges, high radiation efficiency, and high gains <a ref-type=\"bibr\" anchor=\"ref82\" id=\"context_ref_82_4d3\" data-range=\"ref82\">[82]</a>. This leads to the conclusion that the transparent solar antenna is a reliable source for Wi-Fi applications. This is one step to achieving green and sustainable energy technology goals <a ref-type=\"bibr\" anchor=\"ref25\" id=\"context_ref_25_4d3\" data-range=\"ref25\">[25]</a>. The antenna commercially has potential to use for other applications and for integration in smart devices <a ref-type=\"bibr\" anchor=\"ref86\" id=\"context_ref_86_4d3\" data-range=\"ref86\">[86]</a>. In the near future, it is expected that many applications will be linked with the proposed TCF antenna in transparent devices. In general, both space and design freedom needed to establish future automotive antennas can be offered by utilizing transparent antenna on the rear glass <a ref-type=\"bibr\" anchor=\"ref53\" id=\"context_ref_53_4d3\" data-range=\"ref53\">[53]</a>. Its great features, such as being light, low profile, highly transparent, and flexible, have made it a suitable candidate for applications where an antenna needs to be placed on non-coplanar surfaces or wearable electronic systems <a ref-type=\"bibr\" anchor=\"ref67\" id=\"context_ref_67_4d3\" data-range=\"ref67\">[67]</a>. Promising structures has been shown by the transparent microstrip antenna with FTO layers due to its ability to be have solar cell integration and usage in applications that require concurrent connectivity and visibility <a ref-type=\"bibr\" anchor=\"ref36\" id=\"context_ref_36_4d3\" data-range=\"ref36\">[36]</a>. The solar ground plane has harmful and intrusive effects on the antenna performance, as well as the dissipation in the transparent conductor, which enables the integration of transparent correction antennas with solar cells. In this case, GaAs appears to be suitable as thinner cells <a ref-type=\"bibr\" anchor=\"ref37\" id=\"context_ref_37_4d3\" data-range=\"ref37\">[37]</a>. Thus, the design is a breakthrough in the realization of the IoT paradigm. This will be especially suitable for unobtrusive integration within a clothing, making use of extensive analysis between wearers and their environment interacts by wirelessly transmitting physical information about their wearers and their surrounding environment to the Internet through a question-and-answer protocol <a ref-type=\"bibr\" anchor=\"ref83\" id=\"context_ref_83_4d3\" data-range=\"ref83\">[83]</a>.</p></div><div class=\"section_2\" id=\"sec4d4\"><h4>4) Other Recommendations</h4><p>In the existence of human hand phantoms, due to its change in resonant frequency, it can be improved by future work of invisible antenna geometry developments <a ref-type=\"bibr\" anchor=\"ref56\" id=\"context_ref_56_4d4\" data-range=\"ref56\">[56]</a>. There are many ways for using TCFs for transparent devices. Generally, both space and design freedom are needed to establish future automotive antennas by utilizing transparent antennas on quarter glasses <a ref-type=\"bibr\" anchor=\"ref54\" id=\"context_ref_54_4d4\" data-range=\"ref54\">[54]</a>. For the sake of improvement of optical and electrical performances in transparent antennas, it is vital that research work investigates the different materials composite of TCFs. This improvement is applicable for the near future of transparent mobile devices <a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_4d4\" data-range=\"ref46\">[46]</a>.</p></div></div><div class=\"section_2\" id=\"sec4e\"><h3>E. Significance of the Study</h3><p>In the realm of the systematic transparent antenna in wireless communication, content is considered as a significant influencer within this domain. radar imaging and localization applications have arisen significantly in wireless communication systems <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_4e\" data-range=\"ref74\">[74]</a>, whereby reflectarray with solar cell integration radiation performance can be greatly enhanced to acquire optical region for its solar harvesting performance <a ref-type=\"bibr\" anchor=\"ref64\" id=\"context_ref_64_4e\" data-range=\"ref64\">[64]</a>. A persuasive effect on matching antenna impedance to the antenna can be found on the water patch antenna <a ref-type=\"bibr\" anchor=\"ref70\" id=\"context_ref_70_4e\" data-range=\"ref70\">[70]</a>. It has sufficient optical transparency and ensures the efficient performance of the photovoltaic cells, along with an antenna that has promising bandwidth and radiation efficiency <a ref-type=\"bibr\" anchor=\"ref66\" id=\"context_ref_66_4e\" data-range=\"ref66\">[66]</a>. The design of the proposed TEG has a great advantage due to its ability to minimize heat leakage through its own module and in this matter, under heatsink-limited conditions, the ability to maximize available temperature gradient <a ref-type=\"bibr\" anchor=\"ref38\" id=\"context_ref_38_4e\" data-range=\"ref38\">[38]</a>. The use of homogeneous gold nanolayer deposition design showed a significant improvement in gain but reduced transparency <a ref-type=\"bibr\" anchor=\"ref88\" id=\"context_ref_88_4e\" data-range=\"ref88\">[88]</a>. The transparent Silver Nanowire (AgNW) dependent antennas displayed an unusually high radiation efficiency of about 50% with 85% increment in transparency <a ref-type=\"bibr\" anchor=\"ref42\" id=\"context_ref_42_4e\" data-range=\"ref42\">[42]</a>. The only difference is the minimal use of metal in the top layer without significantly affecting radiation performance and antennas bandwidth, while increasing its efficiency <a ref-type=\"bibr\" anchor=\"ref11\" id=\"context_ref_11_4e\" data-range=\"ref11\">[11]</a>.</p></div></div>\n<div class=\"section\" id=\"sec5\"><div class=\"header article-hdr\"><div class=\"kicker\">\n                                SECTION V.</div><h2>Principles of Design and Development</h2></div><p>Design concepts are a tool that offers customers stronger and more reliable experience. The two forms of concept are general and basic.</p><div class=\"section_2\" id=\"sec5a\"><h3>A. Methodology Steps to Design the Antenna</h3><p>The methodology of design refers to the development of a single situation system or method. To date, the term is most often applied to technological fields about design, software simulation, and systems design. The methodology can change depending on what the researchers want to achieve, such as a single methodology (using one method, software, and equation) or hybrid methodology (using multi-method, software, and equations). <a ref-type=\"fig\" anchor=\"fig8\" class=\"fulltext-link\">Figures 8</a>. list the steps to design a transparent antenna using CST or HFSS.\n<div class=\"figure figure-full\" id=\"fig8\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin8-3044435-large.gif\" data-fig-id=\"fig8\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin8-3044435-small.gif\" alt=\"FIGURE 8. - Methodology Steps to Design the Antenna Using HFSS or CST Software.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 8. </b><fig><p>Methodology Steps to Design the Antenna Using HFSS or CST Software.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec5b\"><h3>B. Software Use for Antenna Simulation</h3><p>Both CST and HFSS are 3D simulators created with different mathematical techniques. High frequency structure simulator (HFSS) is a finite element method (FEM) and more accurate in designing antennas, while Computer Simulation Technology (CST) relies on FIT but popular with antenna designers due to simulation ease. For frequency domain-based simulation, HFSS is better than time-domain simulation. Meanwhile, CST is more user-friendly and more applicable than HFSS <a ref-type=\"bibr\" anchor=\"ref94\" id=\"context_ref_94_5b\" data-range=\"ref94\">[94]</a>. <a ref-type=\"fig\" anchor=\"fig9\" class=\"fulltext-link\">Figure 9</a>. Shows the simulation software depicted in the literature.\n<div class=\"figure figure-full\" id=\"fig9\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin9-3044435-large.gif\" data-fig-id=\"fig9\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin9-3044435-small.gif\" alt=\"FIGURE 9. - Bar chart of software simulation depicted in the literature.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 9. </b><fig><p>Bar chart of software simulation depicted in the literature.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p><div class=\"section_2\" id=\"sec5b1\"><h4>1) CST</h4><p>The 3D EM analytic package is a high-performance analytical package for electromagnetic components and systems to design, analyze, and optimize outcomes. The CST Studio Suite contains electromagnetic field solvers for EM-specific applications in a single user interface. The literature depicts that CST was used to design and simulate transparent antenna in 20 out of 81 articles <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_5b1\" data-range=\"ref3\">[3]</a>, <a ref-type=\"bibr\" anchor=\"ref17\" id=\"context_ref_17_5b1\" data-range=\"ref17\">[17]</a>, <a ref-type=\"bibr\" anchor=\"ref22\" id=\"context_ref_22_5b1\" data-range=\"ref22\">[22]</a>, <a ref-type=\"bibr\" anchor=\"ref23\" id=\"context_ref_23_5b1\" data-range=\"ref23\">[23]</a>, <a ref-type=\"bibr\" anchor=\"ref32\" id=\"context_ref_32_5b1\" data-range=\"ref32\">[32]</a>, <a ref-type=\"bibr\" anchor=\"ref35\" id=\"context_ref_35_5b1\" data-range=\"ref35 ref36 ref37\">[35]</a>–​<a ref-type=\"bibr\" anchor=\"ref37\" id=\"context_ref_37_5b1\" data-range=\"ref35 ref36 ref37\">[37]</a>, <a ref-type=\"bibr\" anchor=\"ref42\" id=\"context_ref_42_5b1\" data-range=\"ref42\">[42]</a>, <a ref-type=\"bibr\" anchor=\"ref50\" id=\"context_ref_50_5b1\" data-range=\"ref50\">[50]</a>, <a ref-type=\"bibr\" anchor=\"ref55\" id=\"context_ref_55_5b1\" data-range=\"ref55\">[55]</a>, <a ref-type=\"bibr\" anchor=\"ref57\" id=\"context_ref_57_5b1\" data-range=\"ref57\">[57]</a>, <a ref-type=\"bibr\" anchor=\"ref65\" id=\"context_ref_65_5b1\" data-range=\"ref65\">[65]</a>, <a ref-type=\"bibr\" anchor=\"ref66\" id=\"context_ref_66_5b1\" data-range=\"ref66\">[66]</a>, <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_5b1\" data-range=\"ref74 ref75 ref76\">[74]</a>–​<a ref-type=\"bibr\" anchor=\"ref76\" id=\"context_ref_76_5b1\" data-range=\"ref74 ref75 ref76\">[76]</a>, <a ref-type=\"bibr\" anchor=\"ref83\" id=\"context_ref_83_5b1\" data-range=\"ref83\">[83]</a>, <a ref-type=\"bibr\" anchor=\"ref87\" id=\"context_ref_87_5b1\" data-range=\"ref87\">[87]</a>, <a ref-type=\"bibr\" anchor=\"ref91\" id=\"context_ref_91_5b1\" data-range=\"ref91\">[91]</a> (24.69%). <a ref-type=\"fig\" anchor=\"fig10\" class=\"fulltext-link\">Figure 10</a>. shows Bar chart of CST software simulation reported in the literature.\n<div class=\"figure figure-full\" id=\"fig10\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin10-3044435-large.gif\" data-fig-id=\"fig10\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin10-3044435-small.gif\" alt=\"FIGURE 10. - Bar chart of CST software simulation reported in the literature.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 10. </b><fig><p>Bar chart of CST software simulation reported in the literature.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec5b2\"><h4>2) HFSS</h4><p>The HFSS is one of many commercial methods used to design antenna systems, as well as to design complex electronic circuit RF components, such as filters and transmission lines. The HFSS was used to design and simulate transparent antenna in 30 out of 81 articles <a ref-type=\"bibr\" anchor=\"ref2\" id=\"context_ref_2_5b2\" data-range=\"ref2\">[2]</a>, <a ref-type=\"bibr\" anchor=\"ref7\" id=\"context_ref_7_5b2\" data-range=\"ref7\">[7]</a>, <a ref-type=\"bibr\" anchor=\"ref18\" id=\"context_ref_18_5b2\" data-range=\"ref18 ref19 ref20 ref21\">[18]</a>–​<a ref-type=\"bibr\" anchor=\"ref21\" id=\"context_ref_21_5b2\" data-range=\"ref18 ref19 ref20 ref21\">[21]</a>, <a ref-type=\"bibr\" anchor=\"ref24\" id=\"context_ref_24_5b2\" data-range=\"ref24\">[24]</a>, <a ref-type=\"bibr\" anchor=\"ref26\" id=\"context_ref_26_5b2\" data-range=\"ref26 ref27 ref28\">[26]</a>–​<a ref-type=\"bibr\" anchor=\"ref28\" id=\"context_ref_28_5b2\" data-range=\"ref26 ref27 ref28\">[28]</a>, <a ref-type=\"bibr\" anchor=\"ref31\" id=\"context_ref_31_5b2\" data-range=\"ref31\">[31]</a>, <a ref-type=\"bibr\" anchor=\"ref33\" id=\"context_ref_33_5b2\" data-range=\"ref33\">[33]</a>, <a ref-type=\"bibr\" anchor=\"ref34\" id=\"context_ref_34_5b2\" data-range=\"ref34\">[34]</a>, <a ref-type=\"bibr\" anchor=\"ref38\" id=\"context_ref_38_5b2\" data-range=\"ref38\">[38]</a>, <a ref-type=\"bibr\" anchor=\"ref39\" id=\"context_ref_39_5b2\" data-range=\"ref39 ref40 ref41\">[39]</a>–​<a ref-type=\"bibr\" anchor=\"ref41\" id=\"context_ref_41_5b2\" data-range=\"ref39 ref40 ref41\">[41]</a>, <a ref-type=\"bibr\" anchor=\"ref44\" id=\"context_ref_44_5b2\" data-range=\"ref44\">[44]</a>, <a ref-type=\"bibr\" anchor=\"ref48\" id=\"context_ref_48_5b2\" data-range=\"ref48\">[48]</a>, <a ref-type=\"bibr\" anchor=\"ref51\" id=\"context_ref_51_5b2\" data-range=\"ref51\">[51]</a>, <a ref-type=\"bibr\" anchor=\"ref60\" id=\"context_ref_60_5b2\" data-range=\"ref60\">[60]</a>, <a ref-type=\"bibr\" anchor=\"ref70\" id=\"context_ref_70_5b2\" data-range=\"ref70\">[70]</a>, <a ref-type=\"bibr\" anchor=\"ref71\" id=\"context_ref_71_5b2\" data-range=\"ref71\">[71]</a>, <a ref-type=\"bibr\" anchor=\"ref73\" id=\"context_ref_73_5b2\" data-range=\"ref73\">[73]</a>, <a ref-type=\"bibr\" anchor=\"ref77\" id=\"context_ref_77_5b2\" data-range=\"ref77\">[77]</a>, <a ref-type=\"bibr\" anchor=\"ref81\" id=\"context_ref_81_5b2\" data-range=\"ref81\">[81]</a>, <a ref-type=\"bibr\" anchor=\"ref82\" id=\"context_ref_82_5b2\" data-range=\"ref82\">[82]</a>, <a ref-type=\"bibr\" anchor=\"ref85\" id=\"context_ref_85_5b2\" data-range=\"ref85\">[85]</a>, <a ref-type=\"bibr\" anchor=\"ref88\" id=\"context_ref_88_5b2\" data-range=\"ref88\">[88]</a>, <a ref-type=\"bibr\" anchor=\"ref95\" id=\"context_ref_95_5b2\" data-range=\"ref95\">[95]</a> (37.03%). <a ref-type=\"fig\" anchor=\"fig11\" class=\"fulltext-link\">Figure 11</a>. shows Bar chart of HFSS software simulation reported in the literature.\n<div class=\"figure figure-full\" id=\"fig11\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin11-3044435-large.gif\" data-fig-id=\"fig11\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin11-3044435-small.gif\" alt=\"FIGURE 11. - Bar chart of HFSS software simulation reported in the literature.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 11. </b><fig><p>Bar chart of HFSS software simulation reported in the literature.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p></div></div><div class=\"section_2\" id=\"sec5c\"><h3>C. Multi Software and Other Software</h3><p>Some researchers used multiple software packages to design and optimize their design of transparent antenna, like HFSS and CST <a ref-type=\"bibr\" anchor=\"ref62\" id=\"context_ref_62_5c\" data-range=\"ref62\">[62]</a>, <a ref-type=\"bibr\" anchor=\"ref67\" id=\"context_ref_67_5c\" data-range=\"ref67\">[67]</a>, and HFSS with Analysis Systems Savant (ANSYS) <a ref-type=\"bibr\" anchor=\"ref59\" id=\"context_ref_59_5c\" data-range=\"ref59\">[59]</a>, HFSS with human tissue model simulator (Sim4life, DYMSTEC) <a ref-type=\"bibr\" anchor=\"ref45\" id=\"context_ref_45_5c\" data-range=\"ref45\">[45]</a>, and HFSS with MATLAP <a ref-type=\"bibr\" anchor=\"ref86\" id=\"context_ref_86_5c\" data-range=\"ref86\">[86]</a>. Other software types had also been applied to design transparent antennas, including commercial software ANSYS with MATLAB <a ref-type=\"bibr\" anchor=\"ref30\" id=\"context_ref_30_5c\" data-range=\"ref30\">[30]</a>, Analysis Systems Designer (ANSYS) <a ref-type=\"bibr\" anchor=\"ref58\" id=\"context_ref_58_5c\" data-range=\"ref58\">[58]</a>, and 3D electromagnetic simulation software <a ref-type=\"bibr\" anchor=\"ref79\" id=\"context_ref_79_5c\" data-range=\"ref79\">[79]</a>. Eight articles (9.87%) had reported on the use of other software packages to design and simulate transparent antennas. Meanwhile, the remaining articles did not reveal the software used to simulate their transparent antennas <a ref-type=\"bibr\" anchor=\"ref11\" id=\"context_ref_11_5c\" data-range=\"ref11\">[11]</a>, <a ref-type=\"bibr\" anchor=\"ref12\" id=\"context_ref_12_5c\" data-range=\"ref12\">[12]</a>, <a ref-type=\"bibr\" anchor=\"ref25\" id=\"context_ref_25_5c\" data-range=\"ref25\">[25]</a>, <a ref-type=\"bibr\" anchor=\"ref43\" id=\"context_ref_43_5c\" data-range=\"ref43\">[43]</a>, <a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_5c\" data-range=\"ref46\">[46]</a>, <a ref-type=\"bibr\" anchor=\"ref47\" id=\"context_ref_47_5c\" data-range=\"ref47\">[47]</a>, <a ref-type=\"bibr\" anchor=\"ref49\" id=\"context_ref_49_5c\" data-range=\"ref49\">[49]</a>, <a ref-type=\"bibr\" anchor=\"ref52\" id=\"context_ref_52_5c\" data-range=\"ref52 ref53 ref54\">[52]</a>–​<a ref-type=\"bibr\" anchor=\"ref54\" id=\"context_ref_54_5c\" data-range=\"ref52 ref53 ref54\">[54]</a>, <a ref-type=\"bibr\" anchor=\"ref56\" id=\"context_ref_56_5c\" data-range=\"ref56\">[56]</a>, <a ref-type=\"bibr\" anchor=\"ref61\" id=\"context_ref_61_5c\" data-range=\"ref61\">[61]</a>, <a ref-type=\"bibr\" anchor=\"ref63\" id=\"context_ref_63_5c\" data-range=\"ref63\">[63]</a>, <a ref-type=\"bibr\" anchor=\"ref64\" id=\"context_ref_64_5c\" data-range=\"ref64\">[64]</a>, <a ref-type=\"bibr\" anchor=\"ref68\" id=\"context_ref_68_5c\" data-range=\"ref68\">[68]</a>, <a ref-type=\"bibr\" anchor=\"ref69\" id=\"context_ref_69_5c\" data-range=\"ref69\">[69]</a>, <a ref-type=\"bibr\" anchor=\"ref72\" id=\"context_ref_72_5c\" data-range=\"ref72\">[72]</a>, <a ref-type=\"bibr\" anchor=\"ref78\" id=\"context_ref_78_5c\" data-range=\"ref78\">[78]</a>, <a ref-type=\"bibr\" anchor=\"ref80\" id=\"context_ref_80_5c\" data-range=\"ref80\">[80]</a>, <a ref-type=\"bibr\" anchor=\"ref92\" id=\"context_ref_92_5c\" data-range=\"ref92\">[92]</a>, <a ref-type=\"bibr\" anchor=\"ref93\" id=\"context_ref_93_5c\" data-range=\"ref93\">[93]</a>.</p></div><div class=\"section_2\" id=\"sec5d\"><h3>D. Techniques Used</h3><p>This section lists the techniques and suggestions for the domain’s future. Most papers addressed the importance of further studies to explore various techniques in order for the transparent antenna to improve efficiency and application. Some of these techniques are Beam Steering Antennas <a ref-type=\"bibr\" anchor=\"ref11\" id=\"context_ref_11_5d\" data-range=\"ref11\">[11]</a>, <a ref-type=\"bibr\" anchor=\"ref48\" id=\"context_ref_48_5d\" data-range=\"ref48\">[48]</a>, <a ref-type=\"bibr\" anchor=\"ref63\" id=\"context_ref_63_5d\" data-range=\"ref63\">[63]</a>, <a ref-type=\"bibr\" anchor=\"ref77\" id=\"context_ref_77_5d\" data-range=\"ref77\">[77]</a>, MIMO Antennas <a ref-type=\"bibr\" anchor=\"ref21\" id=\"context_ref_21_5d\" data-range=\"ref21\">[21]</a>, <a ref-type=\"bibr\" anchor=\"ref57\" id=\"context_ref_57_5d\" data-range=\"ref57\">[57]</a> and Smart Antenna <a ref-type=\"bibr\" anchor=\"ref17\" id=\"context_ref_17_5d\" data-range=\"ref17\">[17]</a>.</p></div></div>\n<div class=\"section\" id=\"sec6\"><div class=\"header article-hdr\"><div class=\"kicker\">\n                                SECTION VI.</div><h2>Critical Analysis</h2></div><div class=\"section_2\" id=\"sec6a\"><h3>A. Prototype Fabrication</h3><p>The fabrication of a transparent antenna is a process to ensure the quality of the antenna based on antenna regulations. The manufacturing of antennas is a mechanism to ensure the successful quality of antennas and the implementation of experimental activities. Usually, thin-film antennas are manufactured using physical vapour deposition, wet etching, photolithography, and screen-printing techniques. Such procedures are complicated and costly. other than that, for antenna production with meshed conductors, complex and costly manufacturing processes are needed, for transparent conductive thin films. Therefore, the conventional conductors demonstrated do not meet the criteria of low-cost or flexible transparent antennas. Conductive options for the development of low-cost, conformal, transparent antennas are inevitable. there are many indicated challenge above in the fabrication challenge. According to the literature, many fabrication methods have been used to fabricate transparent antennas, Sputtering, Laser, Photolithography, Printing Process, Spray Pyrolysis Technique, Physical Vapor Deposition (PVD) Process and other fabrication methods.</p><div class=\"section_2\" id=\"sec6a1\"><h4>1) Sputtering</h4><p>Sputtering is a type of process that removes materials on a solid surface, as a result of transferring momentum between the surface and an energetic particle that is usually an ion. The surface bombardment is commonly acquired by a gas discharge in a confined space between two electrodes. In situations like this, the negative electrode is constantly bombarded by the positive ions produced in the plasma. Generally, the gas employed is argon, as argon ions are species that intrudes the surface. Some types of sputtering are as follows: DC diode sputtering, RF sputtering, DC Triode Sputtering, Magnetron, and Reactive sputtering. The following are reported in the literature: pulsed DC magnetron sputter <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_6a1\" data-range=\"ref3\">[3]</a>, RF magnetron sputtering and spin-coating <a ref-type=\"bibr\" anchor=\"ref28\" id=\"context_ref_28_6a1\" data-range=\"ref28\">[28]</a>, DC magnetron sputtering <a ref-type=\"bibr\" anchor=\"ref40\" id=\"context_ref_40_6a1\" data-range=\"ref40\">[40]</a>, <a ref-type=\"bibr\" anchor=\"ref65\" id=\"context_ref_65_6a1\" data-range=\"ref65\">[65]</a>, DC pulse sputter instrument <a ref-type=\"bibr\" anchor=\"ref43\" id=\"context_ref_43_6a1\" data-range=\"ref43\">[43]</a>, RF sputtering technique <a ref-type=\"bibr\" anchor=\"ref35\" id=\"context_ref_35_6a1\" data-range=\"ref35\">[35]</a>, DC sputtering <a ref-type=\"bibr\" anchor=\"ref68\" id=\"context_ref_68_6a1\" data-range=\"ref68\">[68]</a>, <a ref-type=\"bibr\" anchor=\"ref88\" id=\"context_ref_88_6a1\" data-range=\"ref88\">[88]</a>, RF magnetron sputtering <a ref-type=\"bibr\" anchor=\"ref23\" id=\"context_ref_23_6a1\" data-range=\"ref23\">[23]</a>, <a ref-type=\"bibr\" anchor=\"ref50\" id=\"context_ref_50_6a1\" data-range=\"ref50\">[50]</a>, and sputtering <a ref-type=\"bibr\" anchor=\"ref49\" id=\"context_ref_49_6a1\" data-range=\"ref49\">[49]</a>, <a ref-type=\"bibr\" anchor=\"ref96\" id=\"context_ref_96_6a1\" data-range=\"ref96\">[96]</a>. <a ref-type=\"fig\" anchor=\"fig12\" class=\"fulltext-link\">Figure 12</a>. shows the sputtering process.\n<div class=\"figure figure-full\" id=\"fig12\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin12-3044435-large.gif\" data-fig-id=\"fig12\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin12-3044435-small.gif\" alt=\"FIGURE 12. - Diagram of sputtering process (redrawn from [98]).\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 12. </b><fig><p>Diagram of sputtering process (redrawn from <a ref-type=\"bibr\" anchor=\"ref98\" id=\"context_ref_98_6a1\" data-range=\"ref98\">[98]</a>).</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec6a2\"><h4>2) Laser</h4><p>Laser cutting is a type of technology that uses a laser to cut materials. Schools, small businesses, and hobbyists have started to use them even though this method is usually used for industrial manufacturing applications. Laser cutting functions by directing high-power laser output through optics. Laser and CNC optics (computer numerical control) are used to direct the material or the resulting laser beam. The commercial laser cutting machine uses a motion control system to follow the CNC or G-code for the model to be cut into the material. The laser methods found in the literature are: laser milling machine (LPKF: Proto laser S) <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_6a2\" data-range=\"ref74\">[74]</a>, (LPKF Proto Laser S 124102) laser machine <a ref-type=\"bibr\" anchor=\"ref76\" id=\"context_ref_76_6a2\" data-range=\"ref76\">[76]</a>, <i>laser cutter</i> <a ref-type=\"bibr\" anchor=\"ref19\" id=\"context_ref_19_6a2\" data-range=\"ref19\">[19]</a>, <a ref-type=\"bibr\" anchor=\"ref86\" id=\"context_ref_86_6a2\" data-range=\"ref86\">[86]</a>, <a ref-type=\"bibr\" anchor=\"ref48\" id=\"context_ref_48_6a2\" data-range=\"ref48\">[48]</a>, laser <a ref-type=\"bibr\" anchor=\"ref20\" id=\"context_ref_20_6a2\" data-range=\"ref20\">[20]</a>, laser patterning <a ref-type=\"bibr\" anchor=\"ref93\" id=\"context_ref_93_6a2\" data-range=\"ref93\">[93]</a>, and high-precision laser cutter <a ref-type=\"bibr\" anchor=\"ref48\" id=\"context_ref_48_6a2\" data-range=\"ref48\">[48]</a>. <a ref-type=\"fig\" anchor=\"fig13\" class=\"fulltext-link\">Figure 13</a>. illustrates the laser process.\n<div class=\"figure figure-full\" id=\"fig13\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin13-3044435-large.gif\" data-fig-id=\"fig13\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin13-3044435-small.gif\" alt=\"FIGURE 13. - Diagram of laser process.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 13. </b><fig><p>Diagram of laser process.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec6a3\"><h4>3) Photolithography</h4><p>Photolithography, which is also known as UV lithography or photolithography, is a procedure used to precisely manufacture the pattern of parts on a thin layer or bulk of the substrate (known as foil). Light is used to present a geometric pattern from a light mask (optical mask) to a light-sensitive chemical photoresist (i.e. photosensitive) on the substrate. The list of chemical treatments will etch the exposure pattern into the material or allow the deposition of a new substance in the desired pattern onto the material under photoresist. In more complex integrated circuits, the CMOS chip may pass through the optical lithography cycle up to 50 times. The PHOTOLITHOGRAPHY methods depicted in the literature are: STANDARD PHOTOLITHOGRAPHY <a ref-type=\"bibr\" anchor=\"ref77\" id=\"context_ref_77_6a3\" data-range=\"ref77\">[77]</a>, photolithography <a ref-type=\"bibr\" anchor=\"ref39\" id=\"context_ref_39_6a3\" data-range=\"ref39\">[39]</a>, advanced lithography process <a ref-type=\"bibr\" anchor=\"ref41\" id=\"context_ref_41_6a3\" data-range=\"ref41\">[41]</a>, and standard microwave lithography process <a ref-type=\"bibr\" anchor=\"ref51\" id=\"context_ref_51_6a3\" data-range=\"ref51\">[51]</a>. <a ref-type=\"fig\" anchor=\"fig14\" class=\"fulltext-link\">Figure 14</a>. presents the photolithography process.\n<div class=\"figure figure-full\" id=\"fig14\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin14-3044435-large.gif\" data-fig-id=\"fig14\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin14-3044435-small.gif\" alt=\"FIGURE 14. - Diagram of photolithography process (redrawn from [99]).\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 14. </b><fig><p>Diagram of photolithography process (redrawn from <a ref-type=\"bibr\" anchor=\"ref99\" id=\"context_ref_99_6a3\" data-range=\"ref99\">[99]</a>).</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec6a4\"><h4>4) Printing Process</h4><p>Printed electronics can point to a wide range of technologies used to print electrical devices on a substrate. A substrate is a technical term for any material printed on paper, glass, or cover. Electronic printing technologies are still largely untapped. Some of the major technologies include screen printing, printing, and ink. Different types of materials, processes, and equipment are utilized in 3D object via additive manufacturing production. 3D printing is also called additive manufacturing, as many 3D printing processes available contribute in being naturally additive with several key differences in materials and technologies used in the process <a ref-type=\"bibr\" anchor=\"ref97\" id=\"context_ref_97_6a4\" data-range=\"ref97\">[97]</a>. The types of physical transformations used in 3D printing are light polymerization, melt intrusion, sintering, and production of continuous liquid interface. Some printing processes depicted in the literature are <i>silver ink printing process</i> <a ref-type=\"bibr\" anchor=\"ref55\" id=\"context_ref_55_6a4\" data-range=\"ref55\">[55]</a>, <i>screen or inkjet printing methods</i> <a ref-type=\"bibr\" anchor=\"ref85\" id=\"context_ref_85_6a4\" data-range=\"ref85\">[85]</a>, 3D print <a ref-type=\"bibr\" anchor=\"ref49\" id=\"context_ref_49_6a4\" data-range=\"ref49\">[49]</a>, printing <a ref-type=\"bibr\" anchor=\"ref87\" id=\"context_ref_87_6a4\" data-range=\"ref87\">[87]</a>, printed <a ref-type=\"bibr\" anchor=\"ref42\" id=\"context_ref_42_6a4\" data-range=\"ref42\">[42]</a>, and high precision screen printer <a ref-type=\"bibr\" anchor=\"ref42\" id=\"context_ref_42_6a4\" data-range=\"ref42\">[42]</a>. <a ref-type=\"fig\" anchor=\"fig15\" class=\"fulltext-link\">Figure 15</a>. displays the printing processes.\n<div class=\"figure figure-full\" id=\"fig15\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin15-3044435-large.gif\" data-fig-id=\"fig15\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin15-3044435-small.gif\" alt=\"FIGURE 15. - Diagram of printing process (redrawn from [97]).\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 15. </b><fig><p>Diagram of printing process (redrawn from <a ref-type=\"bibr\" anchor=\"ref97\" id=\"context_ref_97_6a4\" data-range=\"ref97\">[97]</a>).</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec6a5\"><h4>5) Spray Pyrolysis Technique</h4><p>The spray pyrolysis mechanism creates a spray of various precursor solutions, which can be a solution of colloidal or mineral salts. The solution (aerosol) droplets are then heated very quickly in the heating system at certain temperature that crosses through several stages: (1) evaporation of solvent from the surface of the droplets, (2) drying of drops containing the dissolved solvent, (3) annealing the precipitate at high temperatures (pyrolysis), (4) formation of small particles from the formation of a specific phase, (5) formation of solid particles, and (6) solidification of solid particles. As a result of the highly reactive particles obtained after pyrolysis, internal sintering is needed. In the pyrolysis process of spraying, the arrangement of uniform and smooth droplets from the reactants and controlled pyrolysis demand processes that require it. The low-cost spray pyrolysis technology is a predominant method by which porous membranes and membranes with high density and high uniformity of particles are achieved. It is also a great way to obtain ultra-small powders of small molecular size, narrow size distribution, high purity, high porosity, and large area. A regular pyrolysis device contains a spray, a precursor solution, a substrate heater, and a temperature controller. The spray pyrolysis technique is depicted in <a ref-type=\"bibr\" anchor=\"ref36\" id=\"context_ref_36_6a5\" data-range=\"ref36\">[36]</a>, <a ref-type=\"bibr\" anchor=\"ref37\" id=\"context_ref_37_6a5\" data-range=\"ref37\">[37]</a>. <a ref-type=\"fig\" anchor=\"fig16\" class=\"fulltext-link\">Figure 16</a>. illustrates the spray pyrolysis technique.\n<div class=\"figure figure-full\" id=\"fig16\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin16-3044435-large.gif\" data-fig-id=\"fig16\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin16-3044435-small.gif\" alt=\"FIGURE 16. - Diagrams of spray pyrolysis technique (redrawn from [36]).\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 16. </b><fig><p>Diagrams of spray pyrolysis technique (redrawn from <a ref-type=\"bibr\" anchor=\"ref36\" id=\"context_ref_36_6a5\" data-range=\"ref36\">[36]</a>).</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec6a6\"><h4>6) Physical Vapor Deposition (PVD) Process</h4><p>The physical vapor deposition (PVD), sometimes (especially in single crystal growth contexts) known as physical vapor transfer (PVT), determines the different methods of vacuum deposition that can be used to create paint and thin films. The PVD is defined by a process in which the material travels from an adsorbent phase to a vapor phase, and then returns to a condensed phase with a thin film. Evaporation and sputtering are the most common PVD processes. The PVD is used to manufacture components that require thin films for optical, mechanical, electronic, and chemical processing. Semiconductor devices, such as thin-film solar panels, food packaging of covered PET films and balloons, as well as cutting tools coated with titanium nitride for metalworking, are some examples of the use of PVD. Smaller special tools (generally for scientific purposes) were created despite the manufacturing done by PVD tools. The PVD methods found in the literature are: PVD process in high vacuum <a ref-type=\"bibr\" anchor=\"ref45\" id=\"context_ref_45_6a6\" data-range=\"ref45\">[45]</a>, <a ref-type=\"bibr\" anchor=\"ref52\" id=\"context_ref_52_6a6\" data-range=\"ref52\">[52]</a>, <a ref-type=\"bibr\" anchor=\"ref96\" id=\"context_ref_96_6a6\" data-range=\"ref96\">[96]</a> and PVD process <a ref-type=\"bibr\" anchor=\"ref44\" id=\"context_ref_44_6a6\" data-range=\"ref44\">[44]</a>, <a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_6a6\" data-range=\"ref46\">[46]</a>, <a ref-type=\"bibr\" anchor=\"ref56\" id=\"context_ref_56_6a6\" data-range=\"ref56\">[56]</a>. <a ref-type=\"fig\" anchor=\"fig17\" class=\"fulltext-link\">Figure 17</a>. presents the PVD process.\n<div class=\"figure figure-full\" id=\"fig17\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin17-3044435-large.gif\" data-fig-id=\"fig17\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin17-3044435-small.gif\" alt=\"FIGURE 17. - Diagram of PVD process (redrawn from [100]).\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 17. </b><fig><p>Diagram of PVD process (redrawn from <a ref-type=\"bibr\" anchor=\"ref100\" id=\"context_ref_100_6a6\" data-range=\"ref100\">[100]</a>).</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec6a7\"><h4>7) Fabrication Using Other Methods</h4><p>Fabrication antenna design is a mechanism that ensures satisfactory antenna quality and a working prototype. Many methods have been introduced by researchers to design their first prototype, <a ref-type=\"table\" anchor=\"table1\" class=\"fulltext-link\">table 1</a>. Below shows the fabrication using other methods.<div class=\"figure figure-full table\" id=\"table1\"><div class=\"figcaption\"><b class=\"title\">TABLE 1 </b>\nTable Summary of Fabrication Using Other Methods</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin.t1-3044435-large.gif\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin.t1-3044435-small.gif\" alt=\"Table 1- &#10;Table Summary of Fabrication Using Other Methods\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div></p></div></div><div class=\"section_2\" id=\"sec6b\"><h3>B. Validation Technique</h3><p>Besides fabricating the antenna design and making the first prototype to validate the design, researchers have compared their prototypes with the previous designs within similar category, application, performance, and different materials. This is to add to the body of knowledge. The literature depicts many comparisons, as given below:</p><div class=\"section_2\" id=\"sec6b1\"><h4>1) Design</h4><div class=\"section_2\" id=\"sec6b1a\"><h5>a: Same Design</h5><p>In order to validate the design, another design with the same dimensions using solid copper was fabricated <a ref-type=\"bibr\" anchor=\"ref61\" id=\"context_ref_61_6b1a\" data-range=\"ref61\">[61]</a>. In order to determine the antenna performance, antennas made from (IZTO/Ag/IZTO and Ag) were designed and measured <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_6b1a\" data-range=\"ref3\">[3]</a> to be compared with transparent antenna arrays and system output voltage <a ref-type=\"bibr\" anchor=\"ref63\" id=\"context_ref_63_6b1a\" data-range=\"ref63\">[63]</a>. In order to compare antenna performance, two antennas using AgHT-4 and copper were examined <a ref-type=\"bibr\" anchor=\"ref20\" id=\"context_ref_20_6b1a\" data-range=\"ref20\">[20]</a>, as well as with copper-based opaque patch antenna <a ref-type=\"bibr\" anchor=\"ref33\" id=\"context_ref_33_6b1a\" data-range=\"ref33\">[33]</a>, opaque antennas using thin silver (Ag) compared with transparent IAI antennas <a ref-type=\"bibr\" anchor=\"ref45\" id=\"context_ref_45_6b1a\" data-range=\"ref45\">[45]</a>, copper patch antenna counterparts <a ref-type=\"bibr\" anchor=\"ref37\" id=\"context_ref_37_6b1a\" data-range=\"ref37\">[37]</a>, fabricated microstrip patch antenna with copper sheet <a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_6b1a\" data-range=\"ref46\">[46]</a>, and comparison with an array of solid copper <a ref-type=\"bibr\" anchor=\"ref48\" id=\"context_ref_48_6b1a\" data-range=\"ref48\">[48]</a>.</p></div><div class=\"section_2\" id=\"sec6b1b\"><h5>b: Previous Designs</h5><p>Upon comparing previous designs <a ref-type=\"bibr\" anchor=\"ref36\" id=\"context_ref_36_6b1b\" data-range=\"ref36\">[36]</a>, <a ref-type=\"bibr\" anchor=\"ref64\" id=\"context_ref_64_6b1b\" data-range=\"ref64\">[64]</a> with reported various transparent antennas <a ref-type=\"bibr\" anchor=\"ref70\" id=\"context_ref_70_6b1b\" data-range=\"ref70\">[70]</a>, the proposed antenna had less transparency in the literature, but displayed peak gains below 2.6 dB <a ref-type=\"bibr\" anchor=\"ref35\" id=\"context_ref_35_6b1b\" data-range=\"ref35\">[35]</a>.</p></div><div class=\"section_2\" id=\"sec6b1c\"><h5>c: Others</h5><p>The viability of effective transparent antenna built of mesh silver film was validated and evaluated <a ref-type=\"bibr\" anchor=\"ref50\" id=\"context_ref_50_6b1c\" data-range=\"ref50\">[50]</a>. Plastic antennas are viable at microwave frequencies <a ref-type=\"bibr\" anchor=\"ref55\" id=\"context_ref_55_6b1c\" data-range=\"ref55\">[55]</a>. This structure not only allows full exposure of solar cells to sunlight, but also can enhance the antenna performance <a ref-type=\"bibr\" anchor=\"ref82\" id=\"context_ref_82_6b1c\" data-range=\"ref82\">[82]</a>.</p></div></div></div><div class=\"section_2\" id=\"sec6c\"><h3>C. Antenna Analysis</h3><p>Testing of antenna is the step after antenna fabrication and validation. Many methods and devices can be used for testing, depending on the parameters one seeks to test on a developed design.</p><div class=\"section_2\" id=\"sec6c1\"><h4>1) Network Analyzer</h4><p>A network analyzer is an advanced and sophisticated instrument to measure the network parameters of a device. It commonly measures the S-parameter at high frequencies since the reflection and transmission of the signals are easy to measure. <a ref-type=\"table\" anchor=\"table2\" class=\"fulltext-link\">Table. 2</a> shows the Summary of articles used Network Analyzer to test and validated transparent antennas. <a ref-type=\"fig\" anchor=\"fig18\" class=\"fulltext-link\">Figure 18</a>. Shows the Network Analyzer.<div class=\"figure figure-full table\" id=\"table2\"><div class=\"figcaption\"><b class=\"title\">TABLE 2 </b>\nTable Summary of Network Analyzer</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin.t2-3044435-large.gif\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin.t2-3044435-small.gif\" alt=\"Table 2- &#10;Table Summary of Network Analyzer\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div>\n<div class=\"figure figure-full\" id=\"fig18\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin18-3044435-large.gif\" data-fig-id=\"fig18\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin18-3044435-small.gif\" alt=\"FIGURE 18. - Network analyzer.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 18. </b><fig><p>Network analyzer.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec6c2\"><h4>2) Anechoic Chamber</h4><p>Anechoic chamber environments: An anechoic chamber (an-echoic meaning “non-reflective, non-echoing, echo-free”) is a room designed to completely absorb reflections of either sound or electromagnetic waves. The size of the chamber depends on the size of the objects and frequency ranges being tested. The literature has reported the use of anechoic chamber to test antenna <a ref-type=\"bibr\" anchor=\"ref11\" id=\"context_ref_11_6c2\" data-range=\"ref11\">[11]</a>, <a ref-type=\"bibr\" anchor=\"ref18\" id=\"context_ref_18_6c2\" data-range=\"ref18 ref19 ref20 ref21\">[18]</a>–​<a ref-type=\"bibr\" anchor=\"ref21\" id=\"context_ref_21_6c2\" data-range=\"ref18 ref19 ref20 ref21\">[21]</a>, <a ref-type=\"bibr\" anchor=\"ref86\" id=\"context_ref_86_6c2\" data-range=\"ref86\">[86]</a> <a ref-type=\"bibr\" anchor=\"ref25\" id=\"context_ref_25_6c2\" data-range=\"ref25\">[25]</a>, <a ref-type=\"bibr\" anchor=\"ref26\" id=\"context_ref_26_6c2\" data-range=\"ref26\">[26]</a>, <a ref-type=\"bibr\" anchor=\"ref35\" id=\"context_ref_35_6c2\" data-range=\"ref35\">[35]</a>, <a ref-type=\"bibr\" anchor=\"ref39\" id=\"context_ref_39_6c2\" data-range=\"ref39\">[39]</a>, <a ref-type=\"bibr\" anchor=\"ref43\" id=\"context_ref_43_6c2\" data-range=\"ref43\">[43]</a>, <a ref-type=\"bibr\" anchor=\"ref45\" id=\"context_ref_45_6c2\" data-range=\"ref45\">[45]</a>, <a ref-type=\"bibr\" anchor=\"ref47\" id=\"context_ref_47_6c2\" data-range=\"ref47 ref48 ref49\">[47]</a>–​<a ref-type=\"bibr\" anchor=\"ref49\" id=\"context_ref_49_6c2\" data-range=\"ref47 ref48 ref49\">[49]</a>, <a ref-type=\"bibr\" anchor=\"ref52\" id=\"context_ref_52_6c2\" data-range=\"ref52 ref53 ref54 ref55 ref56\">[52]</a>–​<a ref-type=\"bibr\" anchor=\"ref56\" id=\"context_ref_56_6c2\" data-range=\"ref52 ref53 ref54 ref55 ref56\">[56]</a>, <a ref-type=\"bibr\" anchor=\"ref58\" id=\"context_ref_58_6c2\" data-range=\"ref58\">[58]</a>, <a ref-type=\"bibr\" anchor=\"ref60\" id=\"context_ref_60_6c2\" data-range=\"ref60 ref61 ref62\">[60]</a>–​<a ref-type=\"bibr\" anchor=\"ref62\" id=\"context_ref_62_6c2\" data-range=\"ref60 ref61 ref62\">[62]</a>, <a ref-type=\"bibr\" anchor=\"ref64\" id=\"context_ref_64_6c2\" data-range=\"ref64\">[64]</a>, <a ref-type=\"bibr\" anchor=\"ref81\" id=\"context_ref_81_6c2\" data-range=\"ref81\">[81]</a>, <a ref-type=\"bibr\" anchor=\"ref85\" id=\"context_ref_85_6c2\" data-range=\"ref85\">[85]</a>. <a ref-type=\"fig\" anchor=\"fig19\" class=\"fulltext-link\">Figure 19</a>. Shows the Anechoic Chamber.\n<div class=\"figure figure-full\" id=\"fig19\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin19-3044435-large.gif\" data-fig-id=\"fig19\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin19-3044435-small.gif\" alt=\"FIGURE 19. - Anechoic chamber [101].\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 19. </b><fig><p>Anechoic chamber <a ref-type=\"bibr\" anchor=\"ref101\" id=\"context_ref_101_6c2\" data-range=\"ref101\">[101]</a>.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec6c3\"><h4>3) Others</h4><p>The literature depicts other methods to test the antenna, such as FEM-based electromagnetic solver <a ref-type=\"bibr\" anchor=\"ref34\" id=\"context_ref_34_6c3\" data-range=\"ref34\">[34]</a>, Satimo Star lab system <a ref-type=\"bibr\" anchor=\"ref57\" id=\"context_ref_57_6c3\" data-range=\"ref57\">[57]</a>, <a ref-type=\"bibr\" anchor=\"ref49\" id=\"context_ref_49_6c3\" data-range=\"ref49\">[49]</a>, standard waveguide method <a ref-type=\"bibr\" anchor=\"ref64\" id=\"context_ref_64_6c3\" data-range=\"ref64\">[64]</a>, SATIMO complex antenna measurement system <a ref-type=\"bibr\" anchor=\"ref70\" id=\"context_ref_70_6c3\" data-range=\"ref70\">[70]</a>, <a ref-type=\"bibr\" anchor=\"ref72\" id=\"context_ref_72_6c3\" data-range=\"ref72\">[72]</a>, and electromagnetic chamber <a ref-type=\"bibr\" anchor=\"ref43\" id=\"context_ref_43_6c3\" data-range=\"ref43\">[43]</a>, SATIMO complex antenna measurement system <a ref-type=\"bibr\" anchor=\"ref71\" id=\"context_ref_71_6c3\" data-range=\"ref71\">[71]</a>.</p></div></div><div class=\"section_2\" id=\"sec6d\"><h3>D. Antenna Performance</h3><p class=\"has-inline-formula\">When it comes to transparent antenna and wireless system, user and the applications have an important role in the performance connected to the system through the antenna. Antenna performance is based on many factors, such as frequency, gain, physical dimensions, radiation efficiency, bandwidth, substrate, patch materials and transparency. <a ref-type=\"table\" anchor=\"table3\" class=\"fulltext-link\">Table 3</a> lists all the factors mentioned before for transparent antennas based on different materials, designs, and applications. <a ref-type=\"fig\" anchor=\"fig20\" class=\"fulltext-link\">Figure 20</a>, <a ref-type=\"fig\" anchor=\"fig21\" class=\"fulltext-link\">21</a>. Shows the materials based on substrate and the application based on type of study.<div class=\"figure figure-full table\" id=\"table3\"><div class=\"figcaption\"><b class=\"title\">TABLE 3 </b>\nTable Summary of Antennas Performance</div><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin.t3-3044435-large.gif\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin.t3-3044435-small.gif\" alt=\"Table 3- &#10;Table Summary of Antennas Performance\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div></div>\n<div class=\"figure figure-full\" id=\"fig20\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin20-3044435-large.gif\" data-fig-id=\"fig20\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin20-3044435-small.gif\" alt=\"FIGURE 20. - Materials and substrate used for transparent antenna.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 20. </b><fig><p>Materials and substrate used for transparent antenna.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div>\n<div class=\"figure figure-full\" id=\"fig21\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin21-3044435-large.gif\" data-fig-id=\"fig21\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin21-3044435-small.gif\" alt=\"FIGURE 21. - Application based on types of studies.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 21. </b><fig><p>Application based on types of studies.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec6e\"><h3>E. Antenna With Solar Cells</h3><p>Antennas have been integrated with solar cells considering adopting green practice. Studies have attempted to achieve this point for various reasons, such as cost, size, rebuilding of communication features in areas hit by natural disaster, solution to battery issues, and to realize the new 5G concept. Many articles have proposed new methods and designs that incorporate solar cells. The developed in this study embeds articles that have probed into antenna or transparent antenna integrated with solar cells for varied applications. First, the solar cell types are described, and followed by antenna application with solar cell. <a ref-type=\"fig\" anchor=\"fig22\" class=\"fulltext-link\">Figure 22</a>. Shows the literature on antenna with solar cells. In total, 20 out of 81 articles (24.69 %) had assessed antenna integrated with solar approaches.\n<div class=\"figure figure-full\" id=\"fig22\"><!--\n          Workaround for combined images.Eg.- 1000116 Fig. 5\n        --><div class=\"img-wrap\"><a href=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin22-3044435-large.gif\" data-fig-id=\"fig22\"><img src=\"\" data-src-img=\"/mediastore_new/IEEE/content/media/6287639/9668973/9292914/amin22-3044435-small.gif\" alt=\"FIGURE 22. - Literature on antenna with solar cells.\"/><div class=\"zoom\" title=\"View Larger Image\"/></a></div><div class=\"figcaption\"><b class=\"title\">FIGURE 22. </b><fig><p>Literature on antenna with solar cells.</p></fig></div><p class=\"links\"><a href=\"/document/9292914/figures\" class=\"all\">Show All</a></p></div></p></div><div class=\"section_2\" id=\"sec6f\"><h3>F. Amorphous Silicon Solar</h3><p>Antennas have been integrated with amorphous silicon solar for Wi-Fi <a ref-type=\"bibr\" anchor=\"ref63\" id=\"context_ref_63_6f\" data-range=\"ref63\">[63]</a>, x-band satellite <a ref-type=\"bibr\" anchor=\"ref73\" id=\"context_ref_73_6f\" data-range=\"ref73\">[73]</a>, RFID <a ref-type=\"bibr\" anchor=\"ref83\" id=\"context_ref_83_6f\" data-range=\"ref83\">[83]</a>, and indoor applications <a ref-type=\"bibr\" anchor=\"ref49\" id=\"context_ref_49_6f\" data-range=\"ref49\">[49]</a>.</p></div><div class=\"section_2\" id=\"sec6g\"><h3>G. Monocrystalline and Polycrystalline Silicon Solar Cell</h3><p>Antennas have been integrated with monocrystalline and polycrystalline silicon solar cells for the following applications: crystalline silicon solar cell for emerging <i>applications</i> <a ref-type=\"bibr\" anchor=\"ref91\" id=\"context_ref_91_6g\" data-range=\"ref91\">[91]</a>, polycrystalline silicon solar cell for satellite communications <a ref-type=\"bibr\" anchor=\"ref62\" id=\"context_ref_62_6g\" data-range=\"ref62\">[62]</a>, monocrystalline and polycrystalline silicon solar cells for outdoor applications <a ref-type=\"bibr\" anchor=\"ref37\" id=\"context_ref_37_6g\" data-range=\"ref37\">[37]</a>.</p></div><div class=\"section_2\" id=\"sec6h\"><h3>H. Silicon Solar Cell</h3><p>Antennas have been integrated with silicon solar cells for the following purposes: satellite communications <a ref-type=\"bibr\" anchor=\"ref64\" id=\"context_ref_64_6h\" data-range=\"ref64\">[64]</a>, <a ref-type=\"bibr\" anchor=\"ref78\" id=\"context_ref_78_6h\" data-range=\"ref78\">[78]</a>, CubeSat applications <a ref-type=\"bibr\" anchor=\"ref80\" id=\"context_ref_80_6h\" data-range=\"ref80\">[80]</a>, <a ref-type=\"bibr\" anchor=\"ref85\" id=\"context_ref_85_6h\" data-range=\"ref85\">[85]</a>, solar cell application <a ref-type=\"bibr\" anchor=\"ref31\" id=\"context_ref_31_6h\" data-range=\"ref31\">[31]</a>, <a ref-type=\"bibr\" anchor=\"ref66\" id=\"context_ref_66_6h\" data-range=\"ref66\">[66]</a>, <a ref-type=\"bibr\" anchor=\"ref90\" id=\"context_ref_90_6h\" data-range=\"ref90\">[90]</a>, Bluetooth antenna communication <a ref-type=\"bibr\" anchor=\"ref38\" id=\"context_ref_38_6h\" data-range=\"ref38\">[38]</a>, 12 GHz applications <a ref-type=\"bibr\" anchor=\"ref79\" id=\"context_ref_79_6h\" data-range=\"ref79\">[79]</a>, and small satellites <a ref-type=\"bibr\" anchor=\"ref11\" id=\"context_ref_11_6h\" data-range=\"ref11\">[11]</a>, <a ref-type=\"bibr\" anchor=\"ref28\" id=\"context_ref_28_6h\" data-range=\"ref28\">[28]</a>.</p></div><div class=\"section_2\" id=\"sec6i\"><h3>I. GaAs Solar Cell</h3><p>Antennas have been integrated with GA AS solar cell for satellite and terrestrial applications <a ref-type=\"bibr\" anchor=\"ref82\" id=\"context_ref_82_6i\" data-range=\"ref82\">[82]</a>, as well as for CubeSat deployment <a ref-type=\"bibr\" anchor=\"ref81\" id=\"context_ref_81_6i\" data-range=\"ref81\">[81]</a>.</p><p>Numerous studies have integrated antennas or transparent antennas with solar cells to assess their suitability <a ref-type=\"bibr\" anchor=\"ref11\" id=\"context_ref_11_6i\" data-range=\"ref11\">[11]</a>, <a ref-type=\"bibr\" anchor=\"ref28\" id=\"context_ref_28_6i\" data-range=\"ref28\">[28]</a>, <a ref-type=\"bibr\" anchor=\"ref31\" id=\"context_ref_31_6i\" data-range=\"ref31\">[31]</a>, <a ref-type=\"bibr\" anchor=\"ref37\" id=\"context_ref_37_6i\" data-range=\"ref37\">[37]</a>, <a ref-type=\"bibr\" anchor=\"ref38\" id=\"context_ref_38_6i\" data-range=\"ref38\">[38]</a>, <a ref-type=\"bibr\" anchor=\"ref49\" id=\"context_ref_49_6i\" data-range=\"ref49\">[49]</a>, <a ref-type=\"bibr\" anchor=\"ref62\" id=\"context_ref_62_6i\" data-range=\"ref62\">[62]</a>, <a ref-type=\"bibr\" anchor=\"ref63\" id=\"context_ref_63_6i\" data-range=\"ref63\">[63]</a>, <a ref-type=\"bibr\" anchor=\"ref66\" id=\"context_ref_66_6i\" data-range=\"ref66\">[66]</a>, <a ref-type=\"bibr\" anchor=\"ref73\" id=\"context_ref_73_6i\" data-range=\"ref73\">[73]</a>, <a ref-type=\"bibr\" anchor=\"ref79\" id=\"context_ref_79_6i\" data-range=\"ref79 ref80 ref81 ref82 ref83\">[79]</a>–​<a ref-type=\"bibr\" anchor=\"ref83\" id=\"context_ref_83_6i\" data-range=\"ref79 ref80 ref81 ref82 ref83\">[83]</a>, <a ref-type=\"bibr\" anchor=\"ref85\" id=\"context_ref_85_6i\" data-range=\"ref85\">[85]</a>, <a ref-type=\"bibr\" anchor=\"ref91\" id=\"context_ref_91_6i\" data-range=\"ref91\">[91]</a> in promoting green communication <a ref-type=\"bibr\" anchor=\"ref3\" id=\"context_ref_3_6i\" data-range=\"ref3\">[3]</a>, <a ref-type=\"bibr\" anchor=\"ref17\" id=\"context_ref_17_6i\" data-range=\"ref17 ref18 ref19 ref20 ref21 ref22 ref23\">[17]</a>–​<a ref-type=\"bibr\" anchor=\"ref23\" id=\"context_ref_23_6i\" data-range=\"ref17 ref18 ref19 ref20 ref21 ref22 ref23\">[23]</a>, <a ref-type=\"bibr\" anchor=\"ref24\" id=\"context_ref_24_6i\" data-range=\"ref24\">[24]</a>, <a ref-type=\"bibr\" anchor=\"ref25\" id=\"context_ref_25_6i\" data-range=\"ref25\">[25]</a>, <a ref-type=\"bibr\" anchor=\"ref30\" id=\"context_ref_30_6i\" data-range=\"ref30\">[30]</a>, <a ref-type=\"bibr\" anchor=\"ref32\" id=\"context_ref_32_6i\" data-range=\"ref32 ref33 ref34 ref35 ref36\">[32]</a>–​<a ref-type=\"bibr\" anchor=\"ref36\" id=\"context_ref_36_6i\" data-range=\"ref32 ref33 ref34 ref35 ref36\">[36]</a>, <a ref-type=\"bibr\" anchor=\"ref39\" id=\"context_ref_39_6i\" data-range=\"ref39\">[39]</a>, <a ref-type=\"bibr\" anchor=\"ref41\" id=\"context_ref_41_6i\" data-range=\"ref41 ref42 ref43 ref44 ref45 ref46\">[41]</a>–​<a ref-type=\"bibr\" anchor=\"ref46\" id=\"context_ref_46_6i\" data-range=\"ref41 ref42 ref43 ref44 ref45 ref46\">[46]</a>, <a ref-type=\"bibr\" anchor=\"ref48\" id=\"context_ref_48_6i\" data-range=\"ref48\">[48]</a>, <a ref-type=\"bibr\" anchor=\"ref50\" id=\"context_ref_50_6i\" data-range=\"ref50 ref51 ref52 ref53 ref54 ref55 ref56 ref57 ref58 ref59 ref60 ref61\">[50]</a>–​<a ref-type=\"bibr\" anchor=\"ref61\" id=\"context_ref_61_6i\" data-range=\"ref50 ref51 ref52 ref53 ref54 ref55 ref56 ref57 ref58 ref59 ref60 ref61\">[61]</a>, <a ref-type=\"bibr\" anchor=\"ref64\" id=\"context_ref_64_6i\" data-range=\"ref64\">[64]</a>, <a ref-type=\"bibr\" anchor=\"ref65\" id=\"context_ref_65_6i\" data-range=\"ref65\">[65]</a>, <a ref-type=\"bibr\" anchor=\"ref67\" id=\"context_ref_67_6i\" data-range=\"ref67 ref68 ref69 ref70\">[67]</a>–​<a ref-type=\"bibr\" anchor=\"ref70\" id=\"context_ref_70_6i\" data-range=\"ref67 ref68 ref69 ref70\">[70]</a>, <a ref-type=\"bibr\" anchor=\"ref72\" id=\"context_ref_72_6i\" data-range=\"ref72\">[72]</a>, <a ref-type=\"bibr\" anchor=\"ref74\" id=\"context_ref_74_6i\" data-range=\"ref74\">[74]</a>, <a ref-type=\"bibr\" anchor=\"ref76\" id=\"context_ref_76_6i\" data-range=\"ref76\">[76]</a>, <a ref-type=\"bibr\" anchor=\"ref77\" id=\"context_ref_77_6i\" data-range=\"ref77\">[77]</a>, <a ref-type=\"bibr\" anchor=\"ref86\" id=\"context_ref_86_6i\" data-range=\"ref86 ref87 ref88\">[86]</a>–​<a ref-type=\"bibr\" anchor=\"ref88\" id=\"context_ref_88_6i\" data-range=\"ref86 ref87 ref88\">[88]</a>, <a ref-type=\"bibr\" anchor=\"ref92\" id=\"context_ref_92_6i\" data-range=\"ref92\">[92]</a>. We find in the literature some articles show and talk about some effect between the antenna and the solar cell <a ref-type=\"bibr\" anchor=\"ref66\" id=\"context_ref_66_6i\" data-range=\"ref66\">[66]</a>, <a ref-type=\"bibr\" anchor=\"ref85\" id=\"context_ref_85_6i\" data-range=\"ref85\">[85]</a>, <a ref-type=\"bibr\" anchor=\"ref78\" id=\"context_ref_78_6i\" data-range=\"ref78\">[78]</a>.</p></div></div>\n<div class=\"section\" id=\"sec7\"><div class=\"header article-hdr\"><div class=\"kicker\">\n                                SECTION VII.</div><h2>Conclusion</h2></div><p>The previous sections have discussed many transparent antennas designed for different purposes. Various approaches were adopted by the past studies to explain in detail the antennas that they had proposed and assessed. In fact, the number of studies related to transparent antennas has risen. The literature clearly depicts that the antennas proposed by many researchers served a specific condition or application. However, the evaluation of transparent antenna is an emerging and important topic that must be considered. The main contributions of this paper are a comprehensive survey and classification of work related to the evaluation of transparent antenna applications, as well as methods used in the process. The reviewed articles were grouped into four categories. The first included challenges, motives, limitations, and recommendations. Second, it is related to design and development including method, software, and technology used. The third is associated with testing, evaluation, and validation including antenna manufacture, antenna verification, antenna performance, and data analysis. Last final segment discusses the effect between solar cells and antenna, notes gathered from articles about transparent antenna and antenna integrated with solar cell. These contributions enable better understanding of this topic for future endeavor.</p></div>\n</div></div></response>\n"
}